
static NUMBER_COMPACT_ROWS: &[(&str, bool, &[(i32, &str)])] = &[
    (
        "af-ZA",
        false,
        &[(12, " bn"), (9, " mjd"), (6, " m"), (3, " k")],
    ),
    (
        "af-ZA",
        true,
        &[
            (12, " biljoen"),
            (9, " miljard"),
            (6, " miljoen"),
            (3, " duisend"),
        ],
    ),
    (
        "am-ET",
        false,
        &[(12, " ት"), (9, " ቢ"), (6, " ሚ"), (3, " ሺ")],
    ),
    (
        "am-ET",
        true,
        &[(12, " ትሪሊዮን"), (9, " ቢሊዮን"), (6, " ሚሊዮን"), (3, " ሺ")],
    ),
    (
        "ar-EG",
        false,
        &[(12, " ترليون"), (9, " مليار"), (6, " مليون"), (3, " ألف")],
    ),
    (
        "ar-EG",
        true,
        &[(12, " ترليون"), (9, " مليار"), (6, " مليون"), (3, " ألف")],
    ),
    (
        "az-AZ",
        false,
        &[(12, " trln"), (9, " mlrd"), (6, " mln"), (3, "K")],
    ),
    (
        "az-AZ",
        true,
        &[
            (12, " trilyon"),
            (9, " milyard"),
            (6, " milyon"),
            (3, " min"),
        ],
    ),
    (
        "bg-BG",
        false,
        &[(12, " трлн."), (9, " млрд."), (6, " млн."), (3, " хил.")],
    ),
    (
        "bg-BG",
        true,
        &[
            (12, " трилиона"),
            (9, " милиарда"),
            (6, " милиона"),
            (3, " хиляди"),
        ],
    ),
    (
        "bn-BD",
        false,
        &[
            (12, " লা.কো."),
            (11, "কো"),
            (10, "শত কো"),
            (7, " কো"),
            (5, " লা"),
            (3, " হা"),
        ],
    ),
    (
        "bn-BD",
        true,
        &[
            (12, " লাখ কোটি"),
            (11, "কো"),
            (10, "শত কো"),
            (7, " কোটি"),
            (5, " লাখ"),
            (3, " হাজার"),
        ],
    ),
    (
        "ca-ES",
        false,
        &[(12, " B"), (9, " kM"), (6, " M"), (3, " k")],
    ),
    (
        "ca-ES",
        true,
        &[
            (12, " bilions"),
            (9, " milers de milions"),
            (6, " milions"),
            (3, " milers"),
        ],
    ),
    (
        "cs-CZ",
        false,
        &[(12, " bil."), (9, " mld."), (6, " mil."), (3, " tis.")],
    ),
    (
        "cs-CZ",
        true,
        &[
            (12, " bilionů"),
            (9, " miliard"),
            (6, " milionů"),
            (3, " tisíc"),
        ],
    ),
    (
        "da-DK",
        false,
        &[(12, " bio."), (9, " mia."), (6, " mio."), (3, " t")],
    ),
    (
        "da-DK",
        true,
        &[
            (12, " billioner"),
            (9, " milliarder"),
            (6, " millioner"),
            (3, " tusind"),
        ],
    ),
    ("de-DE", false, &[(12, " Bio."), (9, " Mrd."), (6, " Mio.")]),
    (
        "de-DE",
        true,
        &[
            (12, " Billionen"),
            (9, " Milliarden"),
            (6, " Millionen"),
            (3, " Tausend"),
        ],
    ),
    (
        "el-GR",
        false,
        &[(12, " τρισ."), (9, " δισ."), (6, " εκ."), (3, " χιλ.")],
    ),
    (
        "el-GR",
        true,
        &[
            (12, " τρισεκατομμύρια"),
            (9, " δισεκατομμύρια"),
            (6, " εκατομμύρια"),
            (3, " χιλιάδες"),
        ],
    ),
    ("en-US", false, &[(12, "T"), (9, "B"), (6, "M"), (3, "K")]),
    (
        "en-US",
        true,
        &[
            (12, " trillion"),
            (9, " billion"),
            (6, " million"),
            (3, " thousand"),
        ],
    ),
    (
        "es-ES",
        false,
        &[(12, " B"), (9, " mil M"), (6, " M"), (3, " mil")],
    ),
    (
        "es-ES",
        true,
        &[
            (12, " billones"),
            (9, " mil millones"),
            (6, " millones"),
            (3, " mil"),
        ],
    ),
    (
        "fa-IR",
        false,
        &[
            (12, " تریلیون"),
            (9, " میلیارد"),
            (6, " میلیون"),
            (3, " هزار"),
        ],
    ),
    (
        "fa-IR",
        true,
        &[
            (12, " هزارمیلیارد"),
            (9, " میلیارد"),
            (6, " میلیون"),
            (3, " هزار"),
        ],
    ),
    (
        "fi-FI",
        false,
        &[(12, " bilj."), (9, " mrd."), (6, " milj."), (3, " t.")],
    ),
    (
        "fi-FI",
        true,
        &[
            (12, " biljoonaa"),
            (9, " miljardia"),
            (6, " miljoonaa"),
            (3, " tuhatta"),
        ],
    ),
    ("fil-PH", false, &[(12, "T"), (9, "B"), (6, "M"), (3, "K")]),
    (
        "fil-PH",
        true,
        &[
            (12, " na trilyon"),
            (9, " na bilyon"),
            (6, " na milyon"),
            (3, " na libo"),
        ],
    ),
    (
        "fr-FR",
        false,
        &[(12, " Bn"), (9, " Md"), (6, " M"), (3, " k")],
    ),
    (
        "fr-FR",
        true,
        &[
            (12, " billions"),
            (9, " milliards"),
            (6, " millions"),
            (3, " mille"),
        ],
    ),
    ("ha-Arab", false, &[(12, "T"), (9, "B"), (6, "M"), (3, "D")]),
    ("ha-Arab", true, &[(12, ""), (9, ""), (6, ""), (3, "")]),
    ("he-IL", false, &[(12, "T‏"), (9, "B‏"), (6, "M‏"), (3, "K‏")]),
    (
        "he-IL",
        true,
        &[
            (12, " טריליון"),
            (9, " מיליארד"),
            (6, " מיליון"),
            (3, " אלף"),
        ],
    ),
    (
        "hi-IN",
        false,
        &[
            (13, " नील"),
            (11, " ख॰"),
            (9, " अ॰"),
            (7, " क॰"),
            (5, " लाख"),
            (3, " हज़ार"),
        ],
    ),
    (
        "hi-IN",
        true,
        &[
            (13, " नील"),
            (11, " खरब"),
            (9, " अरब"),
            (7, " करोड़"),
            (5, " लाख"),
            (3, " हज़ार"),
        ],
    ),
    (
        "id-ID",
        false,
        &[(12, " T"), (9, " M"), (6, " jt"), (3, " rb")],
    ),
    (
        "id-ID",
        true,
        &[(12, " triliun"), (9, " miliar"), (6, " juta"), (3, " ribu")],
    ),
    (
        "it-IT",
        false,
        &[(12, " Bln"), (9, " Mld"), (6, " Mln"), (3, "K")],
    ),
    (
        "it-IT",
        true,
        &[
            (12, " mila miliardi"),
            (9, " miliardi"),
            (6, " milioni"),
            (3, " mila"),
        ],
    ),
    (
        "ja-JP",
        false,
        &[(16, "京"), (12, "兆"), (8, "億"), (4, "万")],
    ),
    (
        "ja-JP",
        true,
        &[(16, "京"), (12, "兆"), (8, "億"), (4, "万")],
    ),
    (
        "ko-KR",
        false,
        &[(12, "조"), (8, "억"), (4, "만"), (3, "천")],
    ),
    (
        "ko-KR",
        true,
        &[(12, "조"), (8, "억"), (4, "만"), (3, "천")],
    ),
    (
        "ku-TR",
        false,
        &[(12, "TN"), (9, "MR"), (6, "MN"), (3, "H")],
    ),
    (
        "ku-TR",
        true,
        &[
            (12, " trilyon"),
            (9, " milyar"),
            (6, " milyon"),
            (3, " hezar"),
        ],
    ),
    (
        "nb-NO",
        false,
        &[(12, " bill."), (9, " mrd."), (6, " mill."), (3, "k")],
    ),
    (
        "nb-NO",
        true,
        &[
            (12, " billioner"),
            (9, " milliarder"),
            (6, " millioner"),
            (3, " tusen"),
        ],
    ),
    (
        "nn-NO",
        false,
        &[(12, " bill."), (9, " mrd."), (6, " mill."), (3, "k")],
    ),
    (
        "nn-NO",
        true,
        &[
            (12, " billionar"),
            (9, " milliardar"),
            (6, " millionar"),
            (3, " tusen"),
        ],
    ),
    (
        "no-NO",
        false,
        &[(12, " bill."), (9, " mrd."), (6, " mill."), (3, "k")],
    ),
    (
        "no-NO",
        true,
        &[
            (12, " billioner"),
            (9, " milliarder"),
            (6, " millioner"),
            (3, " tusen"),
        ],
    ),
    (
        "pa-Guru-IN",
        false,
        &[
            (13, " ਨੀਲ"),
            (11, " ਖਰਬ"),
            (9, " ਅਰਬ"),
            (7, " ਕਰੋੜ"),
            (5, " ਲੱਖ"),
            (3, " ਹਜ਼ਾਰ"),
        ],
    ),
    (
        "pa-Guru-IN",
        true,
        &[
            (13, " ਨੀਲ"),
            (11, " ਖਰਬ"),
            (9, " ਅਰਬ"),
            (7, " ਕਰੋੜ"),
            (5, " ਲੱਖ"),
            (3, " ਹਜ਼ਾਰ"),
        ],
    ),
    (
        "pl-PL",
        false,
        &[(12, " bln"), (9, " mld"), (6, " mln"), (3, " tys.")],
    ),
    (
        "pl-PL",
        true,
        &[
            (12, " biliona"),
            (9, " miliarda"),
            (6, " miliona"),
            (3, " tysiąca"),
        ],
    ),
    (
        "pt-BR",
        false,
        &[(12, " tri"), (9, " bi"), (6, " mi"), (3, " mil")],
    ),
    (
        "pt-BR",
        true,
        &[
            (12, " trilhões"),
            (9, " bilhões"),
            (6, " milhões"),
            (3, " mil"),
        ],
    ),
    (
        "ro-MD",
        false,
        &[(12, " tril."), (9, " mld."), (6, " mil."), (3, " K")],
    ),
    (
        "ro-MD",
        true,
        &[
            (12, " de trilioane"),
            (9, " de miliarde"),
            (6, " de milioane"),
            (3, " de mii"),
        ],
    ),
    (
        "ru-RU",
        false,
        &[(12, " трлн"), (9, " млрд"), (6, " млн"), (3, " тыс.")],
    ),
    (
        "ru-RU",
        true,
        &[
            (12, " триллиона"),
            (9, " миллиарда"),
            (6, " миллиона"),
            (3, " тысячи"),
        ],
    ),
    (
        "sr-Cyrl-RS",
        false,
        &[(12, " бил."), (9, " млрд."), (6, " мил."), (3, " хиљ.")],
    ),
    (
        "sr-Cyrl-RS",
        true,
        &[
            (12, " билиона"),
            (9, " милијарди"),
            (6, " милиона"),
            (3, " хиљада"),
        ],
    ),
    (
        "sr-Latn-RS",
        false,
        &[(12, " bil."), (9, " mlrd."), (6, " mil."), (3, " hilj.")],
    ),
    (
        "sr-Latn-RS",
        true,
        &[
            (12, " biliona"),
            (9, " milijardi"),
            (6, " miliona"),
            (3, " hiljada"),
        ],
    ),
    (
        "sv-SE",
        false,
        &[(12, " bn"), (9, " md"), (6, " mn"), (3, " tn")],
    ),
    (
        "sv-SE",
        true,
        &[
            (12, " biljoner"),
            (9, " miljarder"),
            (6, " miljoner"),
            (3, " tusen"),
        ],
    ),
    ("th-TH", false, &[(12, "T"), (9, "B"), (6, "M"), (3, "K")]),
    (
        "th-TH",
        true,
        &[
            (12, " ล้านล้าน"),
            (11, " แสนล้าน"),
            (10, " หมื่นล้าน"),
            (9, " พันล้าน"),
            (6, " ล้าน"),
            (5, " แสน"),
            (4, " หมื่น"),
            (3, " พัน"),
        ],
    ),
    (
        "tr-TR",
        false,
        &[(12, " Tn"), (9, " Mr"), (6, " Mn"), (3, " B")],
    ),
    (
        "tr-TR",
        true,
        &[
            (12, " trilyon"),
            (9, " milyar"),
            (6, " milyon"),
            (3, " bin"),
        ],
    ),
    (
        "uk-UA",
        false,
        &[(12, " трлн"), (9, " млрд"), (6, " млн"), (3, " тис.")],
    ),
    (
        "uk-UA",
        true,
        &[
            (12, " трильйона"),
            (9, " мільярда"),
            (6, " мільйона"),
            (3, " тисячі"),
        ],
    ),
    (
        "uz-Latn-UZ",
        false,
        &[(12, " trln"), (9, " mlrd"), (6, " mln"), (3, " ming")],
    ),
    (
        "uz-Latn-UZ",
        true,
        &[
            (12, " trillion"),
            (9, " milliard"),
            (6, " million"),
            (3, " ming"),
        ],
    ),
    (
        "vi-VN",
        false,
        &[(12, " NT"), (9, " T"), (6, " Tr"), (3, " N")],
    ),
    (
        "vi-VN",
        true,
        &[(12, " nghìn tỷ"), (9, " tỷ"), (6, " triệu"), (3, " nghìn")],
    ),
    ("yi", false, &[(12, "T"), (9, "B"), (6, "M"), (3, "K")]),
    ("yi", true, &[(12, "T"), (9, "B"), (6, "M"), (3, "K")]),
    ("zh-CN", false, &[(12, "万亿"), (8, "亿"), (4, "万")]),
    ("zh-CN", true, &[(12, "万亿"), (8, "亿"), (4, "万")]),
    ("zh-Hant-TW", false, &[(12, "兆"), (8, "億"), (4, "萬")]),
    ("zh-Hant-TW", true, &[(12, "兆"), (8, "億"), (4, "萬")]),
];

static NUMBER_COMPACT_VARIANT_ROWS: &[(&str, bool, &[(i32, &[(&str, i32, &str, &str)])])] = &[
    (
        "af-ZA",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bn"),
                    ("other", 1, "", " bn"),
                    ("one", 2, "", " bn"),
                    ("other", 2, "", " bn"),
                    ("one", 3, "", " bn"),
                    ("other", 3, "", " bn"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mjd"),
                    ("other", 1, "", " mjd"),
                    ("one", 2, "", " mjd"),
                    ("other", 2, "", " mjd"),
                    ("one", 3, "", " mjd"),
                    ("other", 3, "", " mjd"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " m"),
                    ("other", 1, "", " m"),
                    ("one", 2, "", " m"),
                    ("other", 2, "", " m"),
                    ("one", 3, "", " m"),
                    ("other", 3, "", " m"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " k"),
                    ("other", 1, "", " k"),
                    ("one", 2, "", " k"),
                    ("other", 2, "", " k"),
                    ("one", 3, "", " k"),
                    ("other", 3, "", " k"),
                ],
            ),
        ],
    ),
    (
        "af-ZA",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " biljoen"),
                    ("other", 1, "", " biljoen"),
                    ("one", 2, "", " biljoen"),
                    ("other", 2, "", " biljoen"),
                    ("one", 3, "", " biljoen"),
                    ("other", 3, "", " biljoen"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " miljard"),
                    ("other", 1, "", " miljard"),
                    ("one", 2, "", " miljard"),
                    ("other", 2, "", " miljard"),
                    ("one", 3, "", " miljard"),
                    ("other", 3, "", " miljard"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " miljoen"),
                    ("other", 1, "", " miljoen"),
                    ("one", 2, "", " miljoen"),
                    ("other", 2, "", " miljoen"),
                    ("one", 3, "", " miljoen"),
                    ("other", 3, "", " miljoen"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " duisend"),
                    ("other", 1, "", " duisend"),
                    ("one", 2, "", " duisend"),
                    ("other", 2, "", " duisend"),
                    ("one", 3, "", " duisend"),
                    ("other", 3, "", " duisend"),
                ],
            ),
        ],
    ),
    (
        "am-ET",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " ት"),
                    ("other", 1, "", " ት"),
                    ("one", 2, "", " ት"),
                    ("other", 2, "", " ት"),
                    ("one", 3, "", " ት"),
                    ("other", 3, "", " ት"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " ቢ"),
                    ("other", 1, "", " ቢ"),
                    ("one", 2, "", " ቢ"),
                    ("other", 2, "", " ቢ"),
                    ("one", 3, "", " ቢ"),
                    ("other", 3, "", " ቢ"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " ሚ"),
                    ("other", 1, "", " ሚ"),
                    ("one", 2, "", " ሚ"),
                    ("other", 2, "", " ሚ"),
                    ("one", 3, "", " ሚ"),
                    ("other", 3, "", " ሚ"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " ሺ"),
                    ("other", 1, "", " ሺ"),
                    ("one", 2, "", " ሺ"),
                    ("other", 2, "", " ሺ"),
                    ("one", 3, "", " ሺ"),
                    ("other", 3, "", " ሺ"),
                ],
            ),
        ],
    ),
    (
        "am-ET",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " ትሪሊዮን"),
                    ("other", 1, "", " ትሪሊዮን"),
                    ("one", 2, "", " ትሪሊዮን"),
                    ("other", 2, "", " ትሪሊዮን"),
                    ("one", 3, "", " ትሪሊዮን"),
                    ("other", 3, "", " ትሪሊዮን"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " ቢሊዮን"),
                    ("other", 1, "", " ቢሊዮን"),
                    ("one", 2, "", " ቢሊዮን"),
                    ("other", 2, "", " ቢሊዮን"),
                    ("one", 3, "", " ቢሊዮን"),
                    ("other", 3, "", " ቢሊዮን"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " ሚሊዮን"),
                    ("other", 1, "", " ሚሊዮን"),
                    ("one", 2, "", " ሚሊዮን"),
                    ("other", 2, "", " ሚሊዮን"),
                    ("one", 3, "", " ሚሊዮን"),
                    ("other", 3, "", " ሚሊዮን"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " ሺ"),
                    ("other", 1, "", " ሺ"),
                    ("one", 2, "", " ሺ"),
                    ("other", 2, "", " ሺ"),
                    ("one", 3, "", " ሺ"),
                    ("other", 3, "", " ሺ"),
                ],
            ),
        ],
    ),
    (
        "ar-EG",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " ترليون"),
                    ("other", 1, "", " ترليون"),
                    ("one", 2, "", " ترليون"),
                    ("other", 2, "", " ترليون"),
                    ("one", 3, "", " ترليون"),
                    ("other", 3, "", " ترليون"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " مليار"),
                    ("other", 1, "", " مليار"),
                    ("one", 2, "", " مليار"),
                    ("other", 2, "", " مليار"),
                    ("one", 3, "", " مليار"),
                    ("other", 3, "", " مليار"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " مليون"),
                    ("other", 1, "", " مليون"),
                    ("one", 2, "", " مليون"),
                    ("other", 2, "", " مليون"),
                    ("one", 3, "", " مليون"),
                    ("other", 3, "", " مليون"),
                ],
            ),
            (
                3,
                &[
                    ("few", 1, "", " آلاف"),
                    ("many", 1, "", " ألف"),
                    ("one", 1, "", " ألف"),
                    ("other", 1, "", " ألف"),
                    ("two", 1, "", " ألف"),
                    ("zero", 1, "", " ألف"),
                    ("few", 2, "", " ألف"),
                    ("many", 2, "", " ألف"),
                    ("one", 2, "", " ألف"),
                    ("other", 2, "", " ألف"),
                    ("two", 2, "", " ألف"),
                    ("zero", 2, "", " ألف"),
                    ("few", 3, "", " ألف"),
                    ("many", 3, "", " ألف"),
                    ("one", 3, "", " ألف"),
                    ("other", 3, "", " ألف"),
                    ("two", 3, "", " ألف"),
                    ("zero", 3, "", " ألف"),
                ],
            ),
        ],
    ),
    (
        "ar-EG",
        true,
        &[
            (
                12,
                &[
                    ("few", 1, "", " ترليون"),
                    ("many", 1, "", " ترليون"),
                    ("one", 1, "", " ترليون"),
                    ("other", 1, "", " ترليون"),
                    ("two", 1, "", " ترليون"),
                    ("zero", 1, "", " ترليون"),
                    ("few", 2, "", " ترليون"),
                    ("many", 2, "", " ترليون"),
                    ("one", 2, "", " ترليون"),
                    ("other", 2, "", " ترليون"),
                    ("two", 2, "", " ترليون"),
                    ("zero", 2, "", " ترليون"),
                    ("few", 3, "", " ترليون"),
                    ("many", 3, "", " ترليون"),
                    ("one", 3, "", " ترليون"),
                    ("other", 3, "", " ترليون"),
                    ("two", 3, "", " ترليون"),
                    ("zero", 3, "", " ترليون"),
                ],
            ),
            (
                9,
                &[
                    ("few", 1, "", " مليار"),
                    ("many", 1, "", " مليار"),
                    ("one", 1, "", " مليار"),
                    ("other", 1, "", " مليار"),
                    ("two", 1, "", " مليار"),
                    ("zero", 1, "", " مليار"),
                    ("few", 2, "", " مليار"),
                    ("many", 2, "", " مليار"),
                    ("one", 2, "", " مليار"),
                    ("other", 2, "", " مليار"),
                    ("two", 2, "", " مليار"),
                    ("zero", 2, "", " مليار"),
                    ("few", 3, "", " مليار"),
                    ("many", 3, "", " مليار"),
                    ("one", 3, "", " مليار"),
                    ("other", 3, "", " مليار"),
                    ("two", 3, "", " مليار"),
                    ("zero", 3, "", " مليار"),
                ],
            ),
            (
                6,
                &[
                    ("few", 1, "", " ملايين"),
                    ("many", 1, "", " مليون"),
                    ("one", 1, "", " مليون"),
                    ("other", 1, "", " مليون"),
                    ("two", 1, "", " مليون"),
                    ("zero", 1, "", " مليون"),
                    ("few", 2, "", " ملايين"),
                    ("many", 2, "", " مليون"),
                    ("one", 2, "", " مليون"),
                    ("other", 2, "", " مليون"),
                    ("two", 2, "", " مليون"),
                    ("zero", 2, "", " مليون"),
                    ("few", 3, "", " مليون"),
                    ("many", 3, "", " مليون"),
                    ("one", 3, "", " مليون"),
                    ("other", 3, "", " مليون"),
                    ("two", 3, "", " مليون"),
                    ("zero", 3, "", " مليون"),
                ],
            ),
            (
                3,
                &[
                    ("few", 1, "", " آلاف"),
                    ("many", 1, "", " ألف"),
                    ("one", 1, "", " ألف"),
                    ("other", 1, "", " ألف"),
                    ("two", 1, "", " ألف"),
                    ("zero", 1, "", " ألف"),
                    ("few", 2, "", " ألف"),
                    ("many", 2, "", " ألف"),
                    ("one", 2, "", " ألف"),
                    ("other", 2, "", " ألف"),
                    ("two", 2, "", " ألف"),
                    ("zero", 2, "", " ألف"),
                    ("few", 3, "", " ألف"),
                    ("many", 3, "", " ألف"),
                    ("one", 3, "", " ألف"),
                    ("other", 3, "", " ألف"),
                    ("two", 3, "", " ألف"),
                    ("zero", 3, "", " ألف"),
                ],
            ),
        ],
    ),
    (
        "az-AZ",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " trln"),
                    ("other", 1, "", " trln"),
                    ("one", 2, "", " trln"),
                    ("other", 2, "", " trln"),
                    ("one", 3, "", " trln"),
                    ("other", 3, "", " trln"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mlrd"),
                    ("other", 1, "", " mlrd"),
                    ("one", 2, "", " mlrd"),
                    ("other", 2, "", " mlrd"),
                    ("one", 3, "", " mlrd"),
                    ("other", 3, "", " mlrd"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mln"),
                    ("other", 1, "", " mln"),
                    ("one", 2, "", " mln"),
                    ("other", 2, "", " mln"),
                    ("one", 3, "", " mln"),
                    ("other", 3, "", " mln"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "K"),
                    ("other", 1, "", "K"),
                    ("one", 2, "", "K"),
                    ("other", 2, "", "K"),
                    ("one", 3, "", "K"),
                    ("other", 3, "", "K"),
                ],
            ),
        ],
    ),
    (
        "az-AZ",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " trilyon"),
                    ("other", 1, "", " trilyon"),
                    ("one", 2, "", " trilyon"),
                    ("other", 2, "", " trilyon"),
                    ("one", 3, "", " trilyon"),
                    ("other", 3, "", " trilyon"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " milyard"),
                    ("other", 1, "", " milyard"),
                    ("one", 2, "", " milyard"),
                    ("other", 2, "", " milyard"),
                    ("one", 3, "", " milyard"),
                    ("other", 3, "", " milyard"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " milyon"),
                    ("other", 1, "", " milyon"),
                    ("one", 2, "", " milyon"),
                    ("other", 2, "", " milyon"),
                    ("one", 3, "", " milyon"),
                    ("other", 3, "", " milyon"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " min"),
                    ("other", 1, "", " min"),
                    ("one", 2, "", " min"),
                    ("other", 2, "", " min"),
                    ("one", 3, "", " min"),
                    ("other", 3, "", " min"),
                ],
            ),
        ],
    ),
    (
        "bg-BG",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " трлн."),
                    ("other", 1, "", " трлн."),
                    ("one", 2, "", " трлн."),
                    ("other", 2, "", " трлн."),
                    ("one", 3, "", " трлн."),
                    ("other", 3, "", " трлн."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " млрд."),
                    ("other", 1, "", " млрд."),
                    ("one", 2, "", " млрд."),
                    ("other", 2, "", " млрд."),
                    ("one", 3, "", " млрд."),
                    ("other", 3, "", " млрд."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " млн."),
                    ("other", 1, "", " млн."),
                    ("one", 2, "", " млн."),
                    ("other", 2, "", " млн."),
                    ("one", 3, "", " млн."),
                    ("other", 3, "", " млн."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " хил."),
                    ("other", 1, "", " хил."),
                    ("one", 2, "", " хил."),
                    ("other", 2, "", " хил."),
                    ("one", 3, "", " хил."),
                    ("other", 3, "", " хил."),
                ],
            ),
        ],
    ),
    (
        "bg-BG",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " трилион"),
                    ("other", 1, "", " трилиона"),
                    ("one", 2, "", " трилиона"),
                    ("other", 2, "", " трилиона"),
                    ("one", 3, "", " трилиона"),
                    ("other", 3, "", " трилиона"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " милиард"),
                    ("other", 1, "", " милиарда"),
                    ("one", 2, "", " милиарда"),
                    ("other", 2, "", " милиарда"),
                    ("one", 3, "", " милиарда"),
                    ("other", 3, "", " милиарда"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " милион"),
                    ("other", 1, "", " милиона"),
                    ("one", 2, "", " милиона"),
                    ("other", 2, "", " милиона"),
                    ("one", 3, "", " милиона"),
                    ("other", 3, "", " милиона"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " хил."),
                    ("other", 1, "", " хиляди"),
                    ("one", 2, "", " хиляди"),
                    ("other", 2, "", " хиляди"),
                    ("one", 3, "", " хиляди"),
                    ("other", 3, "", " хиляди"),
                ],
            ),
        ],
    ),
    (
        "bn-BD",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " লা.কো."),
                    ("other", 1, "", " লা.কো."),
                    ("one", 2, "", " লা.কো."),
                    ("other", 2, "", " লা.কো."),
                    ("one", 3, "", " লা.কো."),
                    ("other", 3, "", " লা.কো."),
                ],
            ),
            (11, &[("one", 1, "", "কো"), ("other", 1, "", "কো")]),
            (10, &[("one", 1, "", " শত কো"), ("other", 1, "", "শত কো")]),
            (
                7,
                &[
                    ("one", 1, "", " কো"),
                    ("other", 1, "", " কো"),
                    ("one", 2, "", " কো"),
                    ("other", 2, "", " কো"),
                    ("one", 3, "", " কো"),
                    ("other", 3, "", " কো"),
                ],
            ),
            (
                5,
                &[
                    ("one", 1, "", " লা"),
                    ("other", 1, "", " লা"),
                    ("one", 2, "", " লা"),
                    ("other", 2, "", " লা"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " হা"),
                    ("other", 1, "", " হা"),
                    ("one", 2, "", " হা"),
                    ("other", 2, "", " হা"),
                ],
            ),
        ],
    ),
    (
        "bn-BD",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " লাখ কোটি"),
                    ("other", 1, "", " লাখ কোটি"),
                    ("one", 2, "", " লাখ কোটি"),
                    ("other", 2, "", " লাখ কোটি"),
                    ("one", 3, "", " লাখ কোটি"),
                    ("other", 3, "", " লাখ কোটি"),
                ],
            ),
            (11, &[("one", 1, "", "কো"), ("other", 1, "", "কো")]),
            (10, &[("one", 1, "", " শত কো"), ("other", 1, "", "শত কো")]),
            (
                7,
                &[
                    ("one", 1, "", " কোটি"),
                    ("other", 1, "", " কোটি"),
                    ("one", 2, "", " কোটি"),
                    ("other", 2, "", " কোটি"),
                    ("one", 3, "", " কোটি"),
                    ("other", 3, "", " কোটি"),
                    ("one", 4, "", " কোটি"),
                    ("other", 4, "", " কোটি"),
                    ("one", 5, "", " কোটি"),
                    ("other", 5, "", " কোটি"),
                ],
            ),
            (
                5,
                &[
                    ("one", 1, "", " লাখ"),
                    ("other", 1, "", " লাখ"),
                    ("one", 2, "", " লাখ"),
                    ("other", 2, "", " লাখ"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " হাজার"),
                    ("other", 1, "", " হাজার"),
                    ("one", 2, "", " হাজার"),
                    ("other", 2, "", " হাজার"),
                ],
            ),
        ],
    ),
    (
        "ca-ES",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " B"),
                    ("other", 1, "", " B"),
                    ("one", 2, "", " B"),
                    ("other", 2, "", " B"),
                    ("one", 3, "", " B"),
                    ("other", 3, "", " B"),
                ],
            ),
            (
                9,
                &[
                    ("one", 2, "", " kM"),
                    ("other", 2, "", " kM"),
                    ("one", 3, "", " kM"),
                    ("other", 3, "", " kM"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " M"),
                    ("other", 1, "", " M"),
                    ("one", 2, "", " M"),
                    ("other", 2, "", " M"),
                    ("one", 3, "", " M"),
                    ("other", 3, "", " M"),
                    ("one", 4, "", " M"),
                    ("other", 4, "", " M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " k"),
                    ("other", 1, "", " k"),
                    ("one", 2, "", " k"),
                    ("other", 2, "", " k"),
                    ("one", 3, "", " k"),
                    ("other", 3, "", " k"),
                ],
            ),
        ],
    ),
    (
        "ca-ES",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bilió"),
                    ("other", 1, "", " bilions"),
                    ("one", 2, "", " bilions"),
                    ("other", 2, "", " bilions"),
                    ("one", 3, "", " bilions"),
                    ("other", 3, "", " bilions"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " miler de milions"),
                    ("other", 1, "", " milers de milions"),
                    ("one", 2, "", " milers de milions"),
                    ("other", 2, "", " milers de milions"),
                    ("one", 3, "", " milers de milions"),
                    ("other", 3, "", " milers de milions"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " milió"),
                    ("other", 1, "", " milions"),
                    ("one", 2, "", " milions"),
                    ("other", 2, "", " milions"),
                    ("one", 3, "", " milions"),
                    ("other", 3, "", " milions"),
                    ("one", 4, "", " M"),
                    ("other", 4, "", " M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " miler"),
                    ("other", 1, "", " milers"),
                    ("one", 2, "", " milers"),
                    ("other", 2, "", " milers"),
                    ("one", 3, "", " milers"),
                    ("other", 3, "", " milers"),
                ],
            ),
        ],
    ),
    (
        "cs-CZ",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bil."),
                    ("other", 1, "", " bil."),
                    ("one", 2, "", " bil."),
                    ("other", 2, "", " bil."),
                    ("one", 3, "", " bil."),
                    ("other", 3, "", " bil."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mld."),
                    ("other", 1, "", " mld."),
                    ("one", 2, "", " mld."),
                    ("other", 2, "", " mld."),
                    ("one", 3, "", " mld."),
                    ("other", 3, "", " mld."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mil."),
                    ("other", 1, "", " mil."),
                    ("one", 2, "", " mil."),
                    ("other", 2, "", " mil."),
                    ("one", 3, "", " mil."),
                    ("other", 3, "", " mil."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " tis."),
                    ("other", 1, "", " tis."),
                    ("one", 2, "", " tis."),
                    ("other", 2, "", " tis."),
                    ("one", 3, "", " tis."),
                    ("other", 3, "", " tis."),
                ],
            ),
        ],
    ),
    (
        "cs-CZ",
        true,
        &[
            (
                12,
                &[
                    ("few", 1, "", " biliony"),
                    ("many", 1, "", " bilionu"),
                    ("one", 1, "", " bilion"),
                    ("other", 1, "", " bilionů"),
                    ("few", 2, "", " bilionů"),
                    ("many", 2, "", " bilionu"),
                    ("one", 2, "", " bilionů"),
                    ("other", 2, "", " bilionů"),
                    ("few", 3, "", " bilionů"),
                    ("many", 3, "", " bilionu"),
                    ("one", 3, "", " bilionů"),
                    ("other", 3, "", " bilionů"),
                ],
            ),
            (
                9,
                &[
                    ("few", 1, "", " miliardy"),
                    ("many", 1, "", " miliardy"),
                    ("one", 1, "", " miliarda"),
                    ("other", 1, "", " miliard"),
                    ("few", 2, "", " miliard"),
                    ("many", 2, "", " miliardy"),
                    ("one", 2, "", " miliard"),
                    ("other", 2, "", " miliard"),
                    ("few", 3, "", " miliard"),
                    ("many", 3, "", " miliardy"),
                    ("one", 3, "", " miliard"),
                    ("other", 3, "", " miliard"),
                ],
            ),
            (
                6,
                &[
                    ("few", 1, "", " miliony"),
                    ("many", 1, "", " milionu"),
                    ("one", 1, "", " milion"),
                    ("other", 1, "", " milionů"),
                    ("few", 2, "", " milionů"),
                    ("many", 2, "", " milionu"),
                    ("one", 2, "", " milionů"),
                    ("other", 2, "", " milionů"),
                    ("few", 3, "", " milionů"),
                    ("many", 3, "", " milionu"),
                    ("one", 3, "", " milionů"),
                    ("other", 3, "", " milionů"),
                ],
            ),
            (
                3,
                &[
                    ("few", 1, "", " tisíce"),
                    ("many", 1, "", " tisíce"),
                    ("one", 1, "", " tisíc"),
                    ("other", 1, "", " tisíc"),
                    ("few", 2, "", " tisíc"),
                    ("many", 2, "", " tisíce"),
                    ("one", 2, "", " tisíc"),
                    ("other", 2, "", " tisíc"),
                    ("few", 3, "", " tisíc"),
                    ("many", 3, "", " tisíce"),
                    ("one", 3, "", " tisíc"),
                    ("other", 3, "", " tisíc"),
                ],
            ),
        ],
    ),
    (
        "da-DK",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bio."),
                    ("other", 1, "", " bio."),
                    ("one", 2, "", " bio."),
                    ("other", 2, "", " bio."),
                    ("one", 3, "", " bio."),
                    ("other", 3, "", " bio."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mia."),
                    ("other", 1, "", " mia."),
                    ("one", 2, "", " mia."),
                    ("other", 2, "", " mia."),
                    ("one", 3, "", " mia."),
                    ("other", 3, "", " mia."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mio."),
                    ("other", 1, "", " mio."),
                    ("one", 2, "", " mio."),
                    ("other", 2, "", " mio."),
                    ("one", 3, "", " mio."),
                    ("other", 3, "", " mio."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " t"),
                    ("other", 1, "", " t"),
                    ("one", 2, "", " t"),
                    ("other", 2, "", " t"),
                    ("one", 3, "", " t"),
                    ("other", 3, "", " t"),
                ],
            ),
        ],
    ),
    (
        "da-DK",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " billion"),
                    ("other", 1, "", " billioner"),
                    ("one", 2, "", " billioner"),
                    ("other", 2, "", " billioner"),
                    ("one", 3, "", " billioner"),
                    ("other", 3, "", " billioner"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " milliard"),
                    ("other", 1, "", " milliarder"),
                    ("one", 2, "", " milliarder"),
                    ("other", 2, "", " milliarder"),
                    ("one", 3, "", " milliarder"),
                    ("other", 3, "", " milliarder"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " million"),
                    ("other", 1, "", " millioner"),
                    ("one", 2, "", " millioner"),
                    ("other", 2, "", " millioner"),
                    ("one", 3, "", " millioner"),
                    ("other", 3, "", " millioner"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " tusind"),
                    ("other", 1, "", " tusind"),
                    ("one", 2, "", " tusind"),
                    ("other", 2, "", " tusind"),
                    ("one", 3, "", " tusind"),
                    ("other", 3, "", " tusind"),
                ],
            ),
        ],
    ),
    (
        "de-DE",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " Bio."),
                    ("other", 1, "", " Bio."),
                    ("one", 2, "", " Bio."),
                    ("other", 2, "", " Bio."),
                    ("one", 3, "", " Bio."),
                    ("other", 3, "", " Bio."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " Mrd."),
                    ("other", 1, "", " Mrd."),
                    ("one", 2, "", " Mrd."),
                    ("other", 2, "", " Mrd."),
                    ("one", 3, "", " Mrd."),
                    ("other", 3, "", " Mrd."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " Mio."),
                    ("other", 1, "", " Mio."),
                    ("one", 2, "", " Mio."),
                    ("other", 2, "", " Mio."),
                    ("one", 3, "", " Mio."),
                    ("other", 3, "", " Mio."),
                ],
            ),
        ],
    ),
    (
        "de-DE",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " Billion"),
                    ("other", 1, "", " Billionen"),
                    ("one", 2, "", " Billionen"),
                    ("other", 2, "", " Billionen"),
                    ("one", 3, "", " Billionen"),
                    ("other", 3, "", " Billionen"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " Milliarde"),
                    ("other", 1, "", " Milliarden"),
                    ("one", 2, "", " Milliarden"),
                    ("other", 2, "", " Milliarden"),
                    ("one", 3, "", " Milliarden"),
                    ("other", 3, "", " Milliarden"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " Million"),
                    ("other", 1, "", " Millionen"),
                    ("one", 2, "", " Millionen"),
                    ("other", 2, "", " Millionen"),
                    ("one", 3, "", " Millionen"),
                    ("other", 3, "", " Millionen"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " Tausend"),
                    ("other", 1, "", " Tausend"),
                    ("one", 2, "", " Tausend"),
                    ("other", 2, "", " Tausend"),
                    ("one", 3, "", " Tausend"),
                    ("other", 3, "", " Tausend"),
                ],
            ),
        ],
    ),
    (
        "el-GR",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " τρισ."),
                    ("other", 1, "", " τρισ."),
                    ("one", 2, "", " τρισ."),
                    ("other", 2, "", " τρισ."),
                    ("one", 3, "", " τρισ."),
                    ("other", 3, "", " τρισ."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " δισ."),
                    ("other", 1, "", " δισ."),
                    ("one", 2, "", " δισ."),
                    ("other", 2, "", " δισ."),
                    ("one", 3, "", " δισ."),
                    ("other", 3, "", " δισ."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " εκ."),
                    ("other", 1, "", " εκ."),
                    ("one", 2, "", " εκ."),
                    ("other", 2, "", " εκ."),
                    ("one", 3, "", " εκ."),
                    ("other", 3, "", " εκ."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " χιλ."),
                    ("other", 1, "", " χιλ."),
                    ("one", 2, "", " χιλ."),
                    ("other", 2, "", " χιλ."),
                    ("one", 3, "", " χιλ."),
                    ("other", 3, "", " χιλ."),
                ],
            ),
        ],
    ),
    (
        "el-GR",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " τρισεκατομμύριο"),
                    ("other", 1, "", " τρισεκατομμύρια"),
                    ("one", 2, "", " τρισεκατομμύρια"),
                    ("other", 2, "", " τρισεκατομμύρια"),
                    ("one", 3, "", " τρισεκατομμύρια"),
                    ("other", 3, "", " τρισεκατομμύρια"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " δισεκατομμύριο"),
                    ("other", 1, "", " δισεκατομμύρια"),
                    ("one", 2, "", " δισεκατομμύρια"),
                    ("other", 2, "", " δισεκατομμύρια"),
                    ("one", 3, "", " δισεκατομμύρια"),
                    ("other", 3, "", " δισεκατομμύρια"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " εκατομμύριο"),
                    ("other", 1, "", " εκατομμύρια"),
                    ("one", 2, "", " εκατομμύρια"),
                    ("other", 2, "", " εκατομμύρια"),
                    ("one", 3, "", " εκατομμύρια"),
                    ("other", 3, "", " εκατομμύρια"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " χιλιάδα"),
                    ("other", 1, "", " χιλιάδες"),
                    ("one", 2, "", " χιλιάδες"),
                    ("other", 2, "", " χιλιάδες"),
                    ("one", 3, "", " χιλιάδες"),
                    ("other", 3, "", " χιλιάδες"),
                ],
            ),
        ],
    ),
    (
        "en-US",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", "T"),
                    ("other", 1, "", "T"),
                    ("one", 2, "", "T"),
                    ("other", 2, "", "T"),
                    ("one", 3, "", "T"),
                    ("other", 3, "", "T"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", "B"),
                    ("other", 1, "", "B"),
                    ("one", 2, "", "B"),
                    ("other", 2, "", "B"),
                    ("one", 3, "", "B"),
                    ("other", 3, "", "B"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", "M"),
                    ("other", 1, "", "M"),
                    ("one", 2, "", "M"),
                    ("other", 2, "", "M"),
                    ("one", 3, "", "M"),
                    ("other", 3, "", "M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "K"),
                    ("other", 1, "", "K"),
                    ("one", 2, "", "K"),
                    ("other", 2, "", "K"),
                    ("one", 3, "", "K"),
                    ("other", 3, "", "K"),
                ],
            ),
        ],
    ),
    (
        "en-US",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " trillion"),
                    ("other", 1, "", " trillion"),
                    ("one", 2, "", " trillion"),
                    ("other", 2, "", " trillion"),
                    ("one", 3, "", " trillion"),
                    ("other", 3, "", " trillion"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " billion"),
                    ("other", 1, "", " billion"),
                    ("one", 2, "", " billion"),
                    ("other", 2, "", " billion"),
                    ("one", 3, "", " billion"),
                    ("other", 3, "", " billion"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " million"),
                    ("other", 1, "", " million"),
                    ("one", 2, "", " million"),
                    ("other", 2, "", " million"),
                    ("one", 3, "", " million"),
                    ("other", 3, "", " million"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " thousand"),
                    ("other", 1, "", " thousand"),
                    ("one", 2, "", " thousand"),
                    ("other", 2, "", " thousand"),
                    ("one", 3, "", " thousand"),
                    ("other", 3, "", " thousand"),
                ],
            ),
        ],
    ),
    (
        "es-ES",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " B"),
                    ("other", 1, "", " B"),
                    ("one", 2, "", " B"),
                    ("other", 2, "", " B"),
                    ("one", 3, "", " B"),
                    ("other", 3, "", " B"),
                ],
            ),
            (
                9,
                &[
                    ("one", 2, "", " mil M"),
                    ("other", 2, "", " mil M"),
                    ("one", 3, "", " mil M"),
                    ("other", 3, "", " mil M"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " M"),
                    ("other", 1, "", " M"),
                    ("one", 2, "", " M"),
                    ("other", 2, "", " M"),
                    ("one", 3, "", " M"),
                    ("other", 3, "", " M"),
                    ("one", 4, "", " M"),
                    ("other", 4, "", " M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " mil"),
                    ("other", 1, "", " mil"),
                    ("one", 2, "", " mil"),
                    ("other", 2, "", " mil"),
                    ("one", 3, "", " mil"),
                    ("other", 3, "", " mil"),
                ],
            ),
        ],
    ),
    (
        "es-ES",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " billón"),
                    ("other", 1, "", " billones"),
                    ("one", 2, "", " billones"),
                    ("other", 2, "", " billones"),
                    ("one", 3, "", " billones"),
                    ("other", 3, "", " billones"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mil millones"),
                    ("other", 1, "", " mil millones"),
                    ("one", 2, "", " mil millones"),
                    ("other", 2, "", " mil millones"),
                    ("one", 3, "", " mil millones"),
                    ("other", 3, "", " mil millones"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " millón"),
                    ("other", 1, "", " millones"),
                    ("one", 2, "", " millones"),
                    ("other", 2, "", " millones"),
                    ("one", 3, "", " millones"),
                    ("other", 3, "", " millones"),
                    ("one", 4, "", " M"),
                    ("other", 4, "", " M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " mil"),
                    ("other", 1, "", " mil"),
                    ("one", 2, "", " mil"),
                    ("other", 2, "", " mil"),
                    ("one", 3, "", " mil"),
                    ("other", 3, "", " mil"),
                ],
            ),
        ],
    ),
    (
        "fa-IR",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " تریلیون"),
                    ("other", 1, "", " تریلیون"),
                    ("one", 2, "", " تریلیون"),
                    ("other", 2, "", " تریلیون"),
                    ("one", 3, "", " تریلیون"),
                    ("other", 3, "", " تریلیون"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " میلیارد"),
                    ("other", 1, "", " میلیارد"),
                    ("one", 2, "", " میلیارد"),
                    ("other", 2, "", " میلیارد"),
                    ("one", 3, "", " میلیارد"),
                    ("other", 3, "", " میلیارد"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " میلیون"),
                    ("other", 1, "", " میلیون"),
                    ("one", 2, "", " میلیون"),
                    ("other", 2, "", " میلیون"),
                    ("one", 3, "", " میلیون"),
                    ("other", 3, "", " میلیون"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " هزار"),
                    ("other", 1, "", " هزار"),
                    ("one", 2, "", " هزار"),
                    ("other", 2, "", " هزار"),
                    ("one", 3, "", " هزار"),
                    ("other", 3, "", " هزار"),
                ],
            ),
        ],
    ),
    (
        "fa-IR",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " هزارمیلیارد"),
                    ("other", 1, "", " هزارمیلیارد"),
                    ("one", 2, "", " هزارمیلیارد"),
                    ("other", 2, "", " هزارمیلیارد"),
                    ("one", 3, "", " هزارمیلیارد"),
                    ("other", 3, "", " هزارمیلیارد"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " میلیارد"),
                    ("other", 1, "", " میلیارد"),
                    ("one", 2, "", " میلیارد"),
                    ("other", 2, "", " میلیارد"),
                    ("one", 3, "", " میلیارد"),
                    ("other", 3, "", " میلیارد"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " میلیون"),
                    ("other", 1, "", " میلیون"),
                    ("one", 2, "", " میلیون"),
                    ("other", 2, "", " میلیون"),
                    ("one", 3, "", " میلیون"),
                    ("other", 3, "", " میلیون"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " هزار"),
                    ("other", 1, "", " هزار"),
                    ("one", 2, "", " هزار"),
                    ("other", 2, "", " هزار"),
                    ("one", 3, "", " هزار"),
                    ("other", 3, "", " هزار"),
                ],
            ),
        ],
    ),
    (
        "fi-FI",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bilj."),
                    ("other", 1, "", " bilj."),
                    ("one", 2, "", " bilj."),
                    ("other", 2, "", " bilj."),
                    ("one", 3, "", " bilj."),
                    ("other", 3, "", " bilj."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mrd."),
                    ("other", 1, "", " mrd."),
                    ("one", 2, "", " mrd."),
                    ("other", 2, "", " mrd."),
                    ("one", 3, "", " mrd."),
                    ("other", 3, "", " mrd."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " milj."),
                    ("other", 1, "", " milj."),
                    ("one", 2, "", " milj."),
                    ("other", 2, "", " milj."),
                    ("one", 3, "", " milj."),
                    ("other", 3, "", " milj."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " t."),
                    ("other", 1, "", " t."),
                    ("one", 2, "", " t."),
                    ("other", 2, "", " t."),
                    ("one", 3, "", " t."),
                    ("other", 3, "", " t."),
                ],
            ),
        ],
    ),
    (
        "fi-FI",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " biljoona"),
                    ("other", 1, "", " biljoonaa"),
                    ("one", 2, "", " biljoonaa"),
                    ("other", 2, "", " biljoonaa"),
                    ("one", 3, "", " biljoonaa"),
                    ("other", 3, "", " biljoonaa"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " miljardi"),
                    ("other", 1, "", " miljardia"),
                    ("one", 2, "", " miljardia"),
                    ("other", 2, "", " miljardia"),
                    ("one", 3, "", " miljardia"),
                    ("other", 3, "", " miljardia"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " miljoona"),
                    ("other", 1, "", " miljoonaa"),
                    ("one", 2, "", " miljoonaa"),
                    ("other", 2, "", " miljoonaa"),
                    ("one", 3, "", " miljoonaa"),
                    ("other", 3, "", " miljoonaa"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " tuhat"),
                    ("other", 1, "", " tuhatta"),
                    ("one", 2, "", " tuhatta"),
                    ("other", 2, "", " tuhatta"),
                    ("one", 3, "", " tuhatta"),
                    ("other", 3, "", " tuhatta"),
                ],
            ),
        ],
    ),
    (
        "fil-PH",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", "T"),
                    ("other", 1, "", "T"),
                    ("one", 2, "", "T"),
                    ("other", 2, "", "T"),
                    ("one", 3, "", "T"),
                    ("other", 3, "", "T"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", "B"),
                    ("other", 1, "", "B"),
                    ("one", 2, "", "B"),
                    ("other", 2, "", "B"),
                    ("one", 3, "", "B"),
                    ("other", 3, "", "B"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", "M"),
                    ("other", 1, "", "M"),
                    ("one", 2, "", "M"),
                    ("other", 2, "", "M"),
                    ("one", 3, "", "M"),
                    ("other", 3, "", "M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "K"),
                    ("other", 1, "", "K"),
                    ("one", 2, "", "K"),
                    ("other", 2, "", "K"),
                    ("one", 3, "", "K"),
                    ("other", 3, "", "K"),
                ],
            ),
        ],
    ),
    (
        "fil-PH",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " trilyon"),
                    ("other", 1, "", " na trilyon"),
                    ("one", 2, "", " trilyon"),
                    ("other", 2, "", " na trilyon"),
                    ("one", 3, "", " trilyon"),
                    ("other", 3, "", " na trilyon"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " bilyon"),
                    ("other", 1, "", " na bilyon"),
                    ("one", 2, "", " bilyon"),
                    ("other", 2, "", " na bilyon"),
                    ("one", 3, "", " bilyon"),
                    ("other", 3, "", " na bilyon"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " milyon"),
                    ("other", 1, "", " na milyon"),
                    ("one", 2, "", " milyon"),
                    ("other", 2, "", " na milyon"),
                    ("one", 3, "", " milyon"),
                    ("other", 3, "", " na milyon"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " libo"),
                    ("other", 1, "", " na libo"),
                    ("one", 2, "", " libo"),
                    ("other", 2, "", " na libo"),
                    ("one", 3, "", " libo"),
                    ("other", 3, "", " na libo"),
                ],
            ),
        ],
    ),
    (
        "fr-FR",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " Bn"),
                    ("other", 1, "", " Bn"),
                    ("one", 2, "", " Bn"),
                    ("other", 2, "", " Bn"),
                    ("one", 3, "", " Bn"),
                    ("other", 3, "", " Bn"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " Md"),
                    ("other", 1, "", " Md"),
                    ("one", 2, "", " Md"),
                    ("other", 2, "", " Md"),
                    ("one", 3, "", " Md"),
                    ("other", 3, "", " Md"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " M"),
                    ("other", 1, "", " M"),
                    ("one", 2, "", " M"),
                    ("other", 2, "", " M"),
                    ("one", 3, "", " M"),
                    ("other", 3, "", " M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " k"),
                    ("other", 1, "", " k"),
                    ("one", 2, "", " k"),
                    ("other", 2, "", " k"),
                    ("one", 3, "", " k"),
                    ("other", 3, "", " k"),
                ],
            ),
        ],
    ),
    (
        "fr-FR",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " billion"),
                    ("other", 1, "", " billions"),
                    ("one", 2, "", " billion"),
                    ("other", 2, "", " billions"),
                    ("one", 3, "", " billion"),
                    ("other", 3, "", " billions"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " milliard"),
                    ("other", 1, "", " milliards"),
                    ("one", 2, "", " milliard"),
                    ("other", 2, "", " milliards"),
                    ("one", 3, "", " milliard"),
                    ("other", 3, "", " milliards"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " million"),
                    ("other", 1, "", " millions"),
                    ("one", 2, "", " million"),
                    ("other", 2, "", " millions"),
                    ("one", 3, "", " million"),
                    ("other", 3, "", " millions"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " millier"),
                    ("other", 1, "", " mille"),
                    ("one", 2, "", " mille"),
                    ("other", 2, "", " mille"),
                    ("one", 3, "", " mille"),
                    ("other", 3, "", " mille"),
                ],
            ),
        ],
    ),
    (
        "ha-Arab",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", "T"),
                    ("other", 1, "", "T"),
                    ("one", 2, "", "T"),
                    ("other", 2, "", "T"),
                    ("one", 3, "", "T"),
                    ("other", 3, "", "T"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", "B"),
                    ("other", 1, "", "B"),
                    ("one", 2, "", "B"),
                    ("other", 2, "", "B"),
                    ("one", 3, "", "B"),
                    ("other", 3, "", "B"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", "M"),
                    ("other", 1, "", "M"),
                    ("one", 2, "", "M"),
                    ("other", 2, "", "M"),
                    ("one", 3, "", "M"),
                    ("other", 3, "", "M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "K"),
                    ("other", 1, "", "K"),
                    ("one", 2, "", "D"),
                    ("other", 2, "", "D"),
                    ("one", 3, "", "D"),
                    ("other", 3, "", "D"),
                ],
            ),
        ],
    ),
    (
        "ha-Arab",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "Triliyan ", ""),
                    ("other", 1, "Triliyan ", ""),
                    ("one", 2, "Triliyan ", ""),
                    ("other", 2, "Triliyan ", ""),
                    ("one", 3, "Triliyan ", ""),
                    ("other", 3, "Triliyan ", ""),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "Biliyan ", ""),
                    ("other", 1, "Biliyan ", ""),
                    ("one", 2, "Biliyan ", ""),
                    ("other", 2, "Biliyan ", ""),
                    ("one", 3, "Biliyan ", ""),
                    ("other", 3, "Biliyan ", ""),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "Miliyan ", ""),
                    ("other", 1, "Miliyan ", ""),
                    ("one", 2, "Miliyan ", ""),
                    ("other", 2, "Miliyan ", ""),
                    ("one", 3, "Miliyan ", ""),
                    ("other", 3, "Miliyan ", ""),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "Dubu ", ""),
                    ("other", 1, "Dubu ", ""),
                    ("one", 2, "Dubu ", ""),
                    ("other", 2, "Dubu ", ""),
                    ("one", 3, "Dubu ", ""),
                    ("other", 3, "Dubu ", ""),
                ],
            ),
        ],
    ),
    (
        "he-IL",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", "T‏"),
                    ("other", 1, "", "T‏"),
                    ("one", 2, "", "T‏"),
                    ("other", 2, "", "T‏"),
                    ("one", 3, "", "T‏"),
                    ("other", 3, "", "T‏"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", "B‏"),
                    ("other", 1, "", "B‏"),
                    ("one", 2, "", "B‏"),
                    ("other", 2, "", "B‏"),
                    ("one", 3, "", "B‏"),
                    ("other", 3, "", "B‏"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", "M‏"),
                    ("other", 1, "", "M‏"),
                    ("one", 2, "", "M‏"),
                    ("other", 2, "", "M‏"),
                    ("one", 3, "", "M‏"),
                    ("other", 3, "", "M‏"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "K‏"),
                    ("other", 1, "", "K‏"),
                    ("one", 2, "", "K‏"),
                    ("other", 2, "", "K‏"),
                    ("one", 3, "", "K‏"),
                    ("other", 3, "", "K‏"),
                ],
            ),
        ],
    ),
    (
        "he-IL",
        true,
        &[
            (
                12,
                &[
                    ("many", 1, "‏", " טריליון"),
                    ("one", 1, "‏", " טריליון"),
                    ("other", 1, "‏", " טריליון"),
                    ("two", 1, "‏", " טריליון"),
                    ("many", 2, "‏", " טריליון"),
                    ("one", 2, "‏", " טריליון"),
                    ("other", 2, "‏", " טריליון"),
                    ("two", 2, "‏", " טריליון"),
                    ("many", 3, "‏", " טריליון"),
                    ("one", 3, "‏", " טריליון"),
                    ("other", 3, "‏", " טריליון"),
                    ("two", 3, "‏", " טריליון"),
                ],
            ),
            (
                9,
                &[
                    ("many", 1, "‏", " מיליארד"),
                    ("one", 1, "‏", " מיליארד"),
                    ("other", 1, "‏", " מיליארד"),
                    ("two", 1, "‏", " מיליארד"),
                    ("many", 2, "‏", " מיליארד"),
                    ("one", 2, "‏", " מיליארד"),
                    ("other", 2, "‏", " מיליארד"),
                    ("two", 2, "‏", " מיליארד"),
                    ("many", 3, "‏", " מיליארד"),
                    ("one", 3, "‏", " מיליארד"),
                    ("other", 3, "‏", " מיליארד"),
                    ("two", 3, "‏", " מיליארד"),
                ],
            ),
            (
                6,
                &[
                    ("many", 1, "‏", " מיליון"),
                    ("one", 1, "‏", " מיליון"),
                    ("other", 1, "‏", " מיליון"),
                    ("two", 1, "‏", " מיליון"),
                    ("many", 2, "‏", " מיליון"),
                    ("one", 2, "‏", " מיליון"),
                    ("other", 2, "‏", " מיליון"),
                    ("two", 2, "‏", " מיליון"),
                    ("many", 3, "‏", " מיליון"),
                    ("one", 3, "‏", " מיליון"),
                    ("other", 3, "‏", " מיליון"),
                    ("two", 3, "‏", " מיליון"),
                ],
            ),
            (
                3,
                &[
                    ("many", 1, "‏", " אלף"),
                    ("one", 1, "‏", " אלף"),
                    ("other", 1, "‏", " אלף"),
                    ("two", 1, "‏", " אלף"),
                    ("many", 2, "‏", " אלף"),
                    ("one", 2, "‏", " אלף"),
                    ("other", 2, "‏", " אלף"),
                    ("two", 2, "‏", " אלף"),
                    ("many", 3, "‏", " אלף"),
                    ("one", 3, "‏", " אלף"),
                    ("other", 3, "‏", " אלף"),
                    ("two", 3, "‏", " אלף"),
                ],
            ),
        ],
    ),
    (
        "hi-IN",
        false,
        &[
            (
                13,
                &[
                    ("one", 1, "", " नील"),
                    ("other", 1, "", " नील"),
                    ("one", 2, "", " नील"),
                    ("other", 2, "", " नील"),
                ],
            ),
            (
                11,
                &[
                    ("one", 1, "", " ख॰"),
                    ("other", 1, "", " ख॰"),
                    ("one", 2, "", " ख॰"),
                    ("other", 2, "", " ख॰"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " अ॰"),
                    ("other", 1, "", " अ॰"),
                    ("one", 2, "", " अ॰"),
                    ("other", 2, "", " अ॰"),
                ],
            ),
            (
                7,
                &[
                    ("one", 1, "", " क॰"),
                    ("other", 1, "", " क॰"),
                    ("one", 2, "", " क॰"),
                    ("other", 2, "", " क॰"),
                ],
            ),
            (
                5,
                &[
                    ("one", 1, "", " लाख"),
                    ("other", 1, "", " लाख"),
                    ("one", 2, "", " लाख"),
                    ("other", 2, "", " लाख"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " हज़ार"),
                    ("other", 1, "", " हज़ार"),
                    ("one", 2, "", " हज़ार"),
                    ("other", 2, "", " हज़ार"),
                ],
            ),
        ],
    ),
    (
        "hi-IN",
        true,
        &[
            (
                13,
                &[
                    ("one", 1, "", " नील"),
                    ("other", 1, "", " नील"),
                    ("one", 2, "", " नील"),
                    ("other", 2, "", " नील"),
                ],
            ),
            (
                11,
                &[
                    ("one", 1, "", " खरब"),
                    ("other", 1, "", " खरब"),
                    ("one", 2, "", " खरब"),
                    ("other", 2, "", " खरब"),
                    ("one", 3, "", " खरब"),
                    ("other", 3, "", " खरब"),
                    ("one", 4, "", " खरब"),
                    ("other", 4, "", " खरब"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " अरब"),
                    ("other", 1, "", " अरब"),
                    ("one", 2, "", " अरब"),
                    ("other", 2, "", " अरब"),
                ],
            ),
            (
                7,
                &[
                    ("one", 1, "", " करोड़"),
                    ("other", 1, "", " करोड़"),
                    ("one", 2, "", " करोड़"),
                    ("other", 2, "", " करोड़"),
                ],
            ),
            (
                5,
                &[
                    ("one", 1, "", " लाख"),
                    ("other", 1, "", " लाख"),
                    ("one", 2, "", " लाख"),
                    ("other", 2, "", " लाख"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " हज़ार"),
                    ("other", 1, "", " हज़ार"),
                    ("one", 2, "", " हज़ार"),
                    ("other", 2, "", " हज़ार"),
                ],
            ),
        ],
    ),
    (
        "id-ID",
        false,
        &[
            (
                12,
                &[
                    ("other", 1, "", " T"),
                    ("other", 2, "", " T"),
                    ("other", 3, "", " T"),
                ],
            ),
            (
                9,
                &[
                    ("other", 1, "", " M"),
                    ("other", 2, "", " M"),
                    ("other", 3, "", " M"),
                ],
            ),
            (
                6,
                &[
                    ("other", 1, "", " jt"),
                    ("other", 2, "", " jt"),
                    ("other", 3, "", " jt"),
                ],
            ),
            (
                3,
                &[
                    ("other", 1, "", " rb"),
                    ("other", 2, "", " rb"),
                    ("other", 3, "", " rb"),
                ],
            ),
        ],
    ),
    (
        "id-ID",
        true,
        &[
            (
                12,
                &[
                    ("other", 1, "", " triliun"),
                    ("other", 2, "", " triliun"),
                    ("other", 3, "", " triliun"),
                ],
            ),
            (
                9,
                &[
                    ("other", 1, "", " miliar"),
                    ("other", 2, "", " miliar"),
                    ("other", 3, "", " miliar"),
                ],
            ),
            (
                6,
                &[
                    ("other", 1, "", " juta"),
                    ("other", 2, "", " juta"),
                    ("other", 3, "", " juta"),
                ],
            ),
            (
                3,
                &[
                    ("other", 1, "", " ribu"),
                    ("other", 2, "", " ribu"),
                    ("other", 3, "", " ribu"),
                ],
            ),
        ],
    ),
    (
        "it-IT",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " Bln"),
                    ("other", 1, "", " Bln"),
                    ("one", 2, "", " Bln"),
                    ("other", 2, "", " Bln"),
                    ("one", 3, "", " Bln"),
                    ("other", 3, "", " Bln"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " Mld"),
                    ("other", 1, "", " Mld"),
                    ("one", 2, "", " Mld"),
                    ("other", 2, "", " Mld"),
                    ("one", 3, "", " Mld"),
                    ("other", 3, "", " Mld"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " Mln"),
                    ("other", 1, "", " Mln"),
                    ("one", 2, "", " Mln"),
                    ("other", 2, "", " Mln"),
                    ("one", 3, "", " Mln"),
                    ("other", 3, "", " Mln"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "K"),
                    ("other", 1, "", "K"),
                    ("one", 2, "", "K"),
                    ("other", 2, "", "K"),
                    ("one", 3, "", "K"),
                    ("other", 3, "", "K"),
                ],
            ),
        ],
    ),
    (
        "it-IT",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " mille miliardi"),
                    ("other", 1, "", " mila miliardi"),
                    ("one", 2, "", " mila miliardi"),
                    ("other", 2, "", " mila miliardi"),
                    ("one", 3, "", " mila miliardi"),
                    ("other", 3, "", " mila miliardi"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " miliardo"),
                    ("other", 1, "", " miliardi"),
                    ("one", 2, "", " miliardi"),
                    ("other", 2, "", " miliardi"),
                    ("one", 3, "", " miliardi"),
                    ("other", 3, "", " miliardi"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " milione"),
                    ("other", 1, "", " milioni"),
                    ("one", 2, "", " milioni"),
                    ("other", 2, "", " milioni"),
                    ("one", 3, "", " milioni"),
                    ("other", 3, "", " milioni"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "K"),
                    ("other", 1, "", " mila"),
                    ("one", 2, "", " mila"),
                    ("other", 2, "", " mila"),
                    ("one", 3, "", " mila"),
                    ("other", 3, "", " mila"),
                ],
            ),
        ],
    ),
    (
        "ja-JP",
        false,
        &[
            (
                16,
                &[
                    ("other", 1, "", "京"),
                    ("other", 2, "", "京"),
                    ("other", 3, "", "京"),
                    ("other", 4, "", "京"),
                ],
            ),
            (
                12,
                &[
                    ("other", 1, "", "兆"),
                    ("other", 2, "", "兆"),
                    ("other", 3, "", "兆"),
                    ("other", 4, "", "兆"),
                ],
            ),
            (
                8,
                &[
                    ("other", 1, "", "億"),
                    ("other", 2, "", "億"),
                    ("other", 3, "", "億"),
                    ("other", 4, "", "億"),
                ],
            ),
            (
                4,
                &[
                    ("other", 1, "", "万"),
                    ("other", 2, "", "万"),
                    ("other", 3, "", "万"),
                    ("other", 4, "", "万"),
                ],
            ),
        ],
    ),
    (
        "ja-JP",
        true,
        &[
            (
                16,
                &[
                    ("other", 1, "", "京"),
                    ("other", 2, "", "京"),
                    ("other", 3, "", "京"),
                    ("other", 4, "", "京"),
                ],
            ),
            (
                12,
                &[
                    ("other", 1, "", "兆"),
                    ("other", 2, "", "兆"),
                    ("other", 3, "", "兆"),
                    ("other", 4, "", "兆"),
                ],
            ),
            (
                8,
                &[
                    ("other", 1, "", "億"),
                    ("other", 2, "", "億"),
                    ("other", 3, "", "億"),
                    ("other", 4, "", "億"),
                ],
            ),
            (
                4,
                &[
                    ("other", 1, "", "万"),
                    ("other", 2, "", "万"),
                    ("other", 3, "", "万"),
                    ("other", 4, "", "万"),
                ],
            ),
        ],
    ),
    (
        "ko-KR",
        false,
        &[
            (
                12,
                &[
                    ("other", 1, "", "조"),
                    ("other", 2, "", "조"),
                    ("other", 3, "", "조"),
                ],
            ),
            (
                8,
                &[
                    ("other", 1, "", "억"),
                    ("other", 2, "", "억"),
                    ("other", 3, "", "억"),
                    ("other", 4, "", "억"),
                ],
            ),
            (
                4,
                &[
                    ("other", 1, "", "만"),
                    ("other", 2, "", "만"),
                    ("other", 3, "", "만"),
                    ("other", 4, "", "만"),
                ],
            ),
            (3, &[("other", 1, "", "천")]),
        ],
    ),
    (
        "ko-KR",
        true,
        &[
            (
                12,
                &[
                    ("other", 1, "", "조"),
                    ("other", 2, "", "조"),
                    ("other", 3, "", "조"),
                ],
            ),
            (
                8,
                &[
                    ("other", 1, "", "억"),
                    ("other", 2, "", "억"),
                    ("other", 3, "", "억"),
                    ("other", 4, "", "억"),
                ],
            ),
            (
                4,
                &[
                    ("other", 1, "", "만"),
                    ("other", 2, "", "만"),
                    ("other", 3, "", "만"),
                    ("other", 4, "", "만"),
                ],
            ),
            (3, &[("other", 1, "", "천")]),
        ],
    ),
    (
        "ku-TR",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", "TN"),
                    ("other", 1, "", "TN"),
                    ("one", 2, "", "TN"),
                    ("other", 2, "", "TN"),
                    ("one", 3, "", "TN"),
                    ("other", 3, "", "TN"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", "MR"),
                    ("other", 1, "", "MR"),
                    ("one", 2, "", "MR"),
                    ("other", 2, "", "MR"),
                    ("one", 3, "", "MR"),
                    ("other", 3, "", "MR"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", "MN"),
                    ("other", 1, "", "MN"),
                    ("one", 2, "", "MN"),
                    ("other", 2, "", "MN"),
                    ("one", 3, "", "MN"),
                    ("other", 3, "", "MN"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "H"),
                    ("other", 1, "", "H"),
                    ("one", 2, "", "H"),
                    ("other", 2, "", "H"),
                    ("one", 3, "", "H"),
                    ("other", 3, "", "H"),
                ],
            ),
        ],
    ),
    (
        "ku-TR",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " trilyon"),
                    ("other", 1, "", " trilyon"),
                    ("one", 2, "", " trilyon"),
                    ("other", 2, "", " trilyon"),
                    ("one", 3, "", " trilyon"),
                    ("other", 3, "", " trilyon"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " milyar"),
                    ("other", 1, "", " milyar"),
                    ("one", 2, "", " milyar"),
                    ("other", 2, "", " milyar"),
                    ("one", 3, "", " milyar"),
                    ("other", 3, "", " milyar"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " milyon"),
                    ("other", 1, "", " milyon"),
                    ("one", 2, "", " milyon"),
                    ("other", 2, "", " milyon"),
                    ("one", 3, "", " milyon"),
                    ("other", 3, "", " milyon"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " hezar"),
                    ("other", 1, "", " hezar"),
                    ("one", 2, "", " hezar"),
                    ("other", 2, "", " hezar"),
                    ("one", 3, "", " hezar"),
                    ("other", 3, "", " hezar"),
                ],
            ),
        ],
    ),
    (
        "nb-NO",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bill."),
                    ("other", 1, "", " bill."),
                    ("one", 2, "", " bill."),
                    ("other", 2, "", " bill."),
                    ("one", 3, "", " bill."),
                    ("other", 3, "", " bill."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mrd."),
                    ("other", 1, "", " mrd."),
                    ("one", 2, "", " mrd."),
                    ("other", 2, "", " mrd."),
                    ("one", 3, "", " mrd."),
                    ("other", 3, "", " mrd."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mill."),
                    ("other", 1, "", " mill."),
                    ("one", 2, "", " mill."),
                    ("other", 2, "", " mill."),
                    ("one", 3, "", " mill."),
                    ("other", 3, "", " mill."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "k"),
                    ("other", 1, "", "k"),
                    ("one", 2, "", "k"),
                    ("other", 2, "", "k"),
                    ("one", 3, "", "k"),
                    ("other", 3, "", "k"),
                ],
            ),
        ],
    ),
    (
        "nb-NO",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " billion"),
                    ("other", 1, "", " billioner"),
                    ("one", 2, "", " billioner"),
                    ("other", 2, "", " billioner"),
                    ("one", 3, "", " billioner"),
                    ("other", 3, "", " billioner"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " milliard"),
                    ("other", 1, "", " milliarder"),
                    ("one", 2, "", " milliarder"),
                    ("other", 2, "", " milliarder"),
                    ("one", 3, "", " milliarder"),
                    ("other", 3, "", " milliarder"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " million"),
                    ("other", 1, "", " millioner"),
                    ("one", 2, "", " millioner"),
                    ("other", 2, "", " millioner"),
                    ("one", 3, "", " millioner"),
                    ("other", 3, "", " millioner"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " tusen"),
                    ("other", 1, "", " tusen"),
                    ("one", 2, "", " tusen"),
                    ("other", 2, "", " tusen"),
                    ("one", 3, "", " tusen"),
                    ("other", 3, "", " tusen"),
                ],
            ),
        ],
    ),
    (
        "nn-NO",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bill."),
                    ("other", 1, "", " bill."),
                    ("one", 2, "", " bill."),
                    ("other", 2, "", " bill."),
                    ("one", 3, "", " bill."),
                    ("other", 3, "", " bill."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mrd."),
                    ("other", 1, "", " mrd."),
                    ("one", 2, "", " mrd."),
                    ("other", 2, "", " mrd."),
                    ("one", 3, "", " mrd."),
                    ("other", 3, "", " mrd."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mill."),
                    ("other", 1, "", " mill."),
                    ("one", 2, "", " mill."),
                    ("other", 2, "", " mill."),
                    ("one", 3, "", " mill."),
                    ("other", 3, "", " mill."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "k"),
                    ("other", 1, "", "k"),
                    ("one", 2, "", "k"),
                    ("other", 2, "", "k"),
                    ("one", 3, "", "k"),
                    ("other", 3, "", "k"),
                ],
            ),
        ],
    ),
    (
        "nn-NO",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " billion"),
                    ("other", 1, "", " billionar"),
                    ("one", 2, "", " billionar"),
                    ("other", 2, "", " billionar"),
                    ("one", 3, "", " billionar"),
                    ("other", 3, "", " billionar"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " milliard"),
                    ("other", 1, "", " milliardar"),
                    ("one", 2, "", " milliardar"),
                    ("other", 2, "", " milliardar"),
                    ("one", 3, "", " milliardar"),
                    ("other", 3, "", " milliardar"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " million"),
                    ("other", 1, "", " millionar"),
                    ("one", 2, "", " millionar"),
                    ("other", 2, "", " millionar"),
                    ("one", 3, "", " millionar"),
                    ("other", 3, "", " millionar"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " tusen"),
                    ("other", 1, "", " tusen"),
                    ("one", 2, "", " tusen"),
                    ("other", 2, "", " tusen"),
                    ("one", 3, "", " tusen"),
                    ("other", 3, "", " tusen"),
                ],
            ),
        ],
    ),
    (
        "no-NO",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bill."),
                    ("other", 1, "", " bill."),
                    ("one", 2, "", " bill."),
                    ("other", 2, "", " bill."),
                    ("one", 3, "", " bill."),
                    ("other", 3, "", " bill."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mrd."),
                    ("other", 1, "", " mrd."),
                    ("one", 2, "", " mrd."),
                    ("other", 2, "", " mrd."),
                    ("one", 3, "", " mrd."),
                    ("other", 3, "", " mrd."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mill."),
                    ("other", 1, "", " mill."),
                    ("one", 2, "", " mill."),
                    ("other", 2, "", " mill."),
                    ("one", 3, "", " mill."),
                    ("other", 3, "", " mill."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "k"),
                    ("other", 1, "", "k"),
                    ("one", 2, "", "k"),
                    ("other", 2, "", "k"),
                    ("one", 3, "", "k"),
                    ("other", 3, "", "k"),
                ],
            ),
        ],
    ),
    (
        "no-NO",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " billion"),
                    ("other", 1, "", " billioner"),
                    ("one", 2, "", " billioner"),
                    ("other", 2, "", " billioner"),
                    ("one", 3, "", " billioner"),
                    ("other", 3, "", " billioner"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " milliard"),
                    ("other", 1, "", " milliarder"),
                    ("one", 2, "", " milliarder"),
                    ("other", 2, "", " milliarder"),
                    ("one", 3, "", " milliarder"),
                    ("other", 3, "", " milliarder"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " million"),
                    ("other", 1, "", " millioner"),
                    ("one", 2, "", " millioner"),
                    ("other", 2, "", " millioner"),
                    ("one", 3, "", " millioner"),
                    ("other", 3, "", " millioner"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " tusen"),
                    ("other", 1, "", " tusen"),
                    ("one", 2, "", " tusen"),
                    ("other", 2, "", " tusen"),
                    ("one", 3, "", " tusen"),
                    ("other", 3, "", " tusen"),
                ],
            ),
        ],
    ),
    (
        "pa-Guru-IN",
        false,
        &[
            (
                13,
                &[
                    ("one", 1, "", " ਨੀਲ"),
                    ("other", 1, "", " ਨੀਲ"),
                    ("one", 2, "", " ਨੀਲ"),
                    ("other", 2, "", " ਨੀਲ"),
                ],
            ),
            (
                11,
                &[
                    ("one", 1, "", " ਖਰਬ"),
                    ("other", 1, "", " ਖਰਬ"),
                    ("one", 2, "", " ਖਰਬ"),
                    ("other", 2, "", " ਖਰਬ"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " ਅਰਬ"),
                    ("other", 1, "", " ਅਰਬ"),
                    ("one", 2, "", " ਅਰਬ"),
                    ("other", 2, "", " ਅਰਬ"),
                ],
            ),
            (
                7,
                &[
                    ("one", 1, "", " ਕਰੋੜ"),
                    ("other", 1, "", " ਕਰੋੜ"),
                    ("one", 2, "", " ਕਰੋੜ"),
                    ("other", 2, "", " ਕਰੋੜ"),
                ],
            ),
            (
                5,
                &[
                    ("one", 1, "", " ਲੱਖ"),
                    ("other", 1, "", " ਲੱਖ"),
                    ("one", 2, "", " ਲੱਖ"),
                    ("other", 2, "", " ਲੱਖ"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " ਹਜ਼ਾਰ"),
                    ("other", 1, "", " ਹਜ਼ਾਰ"),
                    ("one", 2, "", " ਹਜ਼ਾਰ"),
                    ("other", 2, "", " ਹਜ਼ਾਰ"),
                ],
            ),
        ],
    ),
    (
        "pa-Guru-IN",
        true,
        &[
            (
                13,
                &[
                    ("one", 1, "", " ਨੀਲ"),
                    ("other", 1, "", " ਨੀਲ"),
                    ("one", 2, "", " ਨੀਲ"),
                    ("other", 2, "", " ਨੀਲ"),
                ],
            ),
            (
                11,
                &[
                    ("one", 1, "", " ਖਰਬ"),
                    ("other", 1, "", " ਖਰਬ"),
                    ("one", 2, "", " ਖਰਬ"),
                    ("other", 2, "", " ਖਰਬ"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " ਅਰਬ"),
                    ("other", 1, "", " ਅਰਬ"),
                    ("one", 2, "", " ਅਰਬ"),
                    ("other", 2, "", " ਅਰਬ"),
                ],
            ),
            (
                7,
                &[
                    ("one", 1, "", " ਕਰੋੜ"),
                    ("other", 1, "", " ਕਰੋੜ"),
                    ("one", 2, "", " ਕਰੋੜ"),
                    ("other", 2, "", " ਕਰੋੜ"),
                ],
            ),
            (
                5,
                &[
                    ("one", 1, "", " ਲੱਖ"),
                    ("other", 1, "", " ਲੱਖ"),
                    ("one", 2, "", " ਲੱਖ"),
                    ("other", 2, "", " ਲੱਖ"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " ਹਜ਼ਾਰ"),
                    ("other", 1, "", " ਹਜ਼ਾਰ"),
                    ("one", 2, "", " ਹਜ਼ਾਰ"),
                    ("other", 2, "", " ਹਜ਼ਾਰ"),
                ],
            ),
        ],
    ),
    (
        "pl-PL",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bln"),
                    ("other", 1, "", " bln"),
                    ("one", 2, "", " bln"),
                    ("other", 2, "", " bln"),
                    ("one", 3, "", " bln"),
                    ("other", 3, "", " bln"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mld"),
                    ("other", 1, "", " mld"),
                    ("one", 2, "", " mld"),
                    ("other", 2, "", " mld"),
                    ("one", 3, "", " mld"),
                    ("other", 3, "", " mld"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mln"),
                    ("other", 1, "", " mln"),
                    ("one", 2, "", " mln"),
                    ("other", 2, "", " mln"),
                    ("one", 3, "", " mln"),
                    ("other", 3, "", " mln"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " tys."),
                    ("other", 1, "", " tys."),
                    ("one", 2, "", " tys."),
                    ("other", 2, "", " tys."),
                    ("one", 3, "", " tys."),
                    ("other", 3, "", " tys."),
                ],
            ),
        ],
    ),
    (
        "pl-PL",
        true,
        &[
            (
                12,
                &[
                    ("few", 1, "", " biliony"),
                    ("many", 1, "", " bilionów"),
                    ("one", 1, "", " bilion"),
                    ("other", 1, "", " biliona"),
                    ("few", 2, "", " biliony"),
                    ("many", 2, "", " bilionów"),
                    ("one", 2, "", " bilion"),
                    ("other", 2, "", " biliona"),
                    ("few", 3, "", " biliony"),
                    ("many", 3, "", " bilionów"),
                    ("one", 3, "", " bilion"),
                    ("other", 3, "", " biliona"),
                ],
            ),
            (
                9,
                &[
                    ("few", 1, "", " miliardy"),
                    ("many", 1, "", " miliardów"),
                    ("one", 1, "", " miliard"),
                    ("other", 1, "", " miliarda"),
                    ("few", 2, "", " miliardy"),
                    ("many", 2, "", " miliardów"),
                    ("one", 2, "", " miliard"),
                    ("other", 2, "", " miliarda"),
                    ("few", 3, "", " miliardy"),
                    ("many", 3, "", " miliardów"),
                    ("one", 3, "", " miliard"),
                    ("other", 3, "", " miliarda"),
                ],
            ),
            (
                6,
                &[
                    ("few", 1, "", " miliony"),
                    ("many", 1, "", " milionów"),
                    ("one", 1, "", " milion"),
                    ("other", 1, "", " miliona"),
                    ("few", 2, "", " miliony"),
                    ("many", 2, "", " milionów"),
                    ("one", 2, "", " milion"),
                    ("other", 2, "", " miliona"),
                    ("few", 3, "", " miliony"),
                    ("many", 3, "", " milionów"),
                    ("one", 3, "", " milion"),
                    ("other", 3, "", " miliona"),
                ],
            ),
            (
                3,
                &[
                    ("few", 1, "", " tysiące"),
                    ("many", 1, "", " tysięcy"),
                    ("one", 1, "", " tysiąc"),
                    ("other", 1, "", " tysiąca"),
                    ("few", 2, "", " tysiące"),
                    ("many", 2, "", " tysięcy"),
                    ("one", 2, "", " tysiąc"),
                    ("other", 2, "", " tysiąca"),
                    ("few", 3, "", " tysiące"),
                    ("many", 3, "", " tysięcy"),
                    ("one", 3, "", " tysiąc"),
                    ("other", 3, "", " tysiąca"),
                ],
            ),
        ],
    ),
    (
        "pt-BR",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " tri"),
                    ("other", 1, "", " tri"),
                    ("one", 2, "", " tri"),
                    ("other", 2, "", " tri"),
                    ("one", 3, "", " tri"),
                    ("other", 3, "", " tri"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " bi"),
                    ("other", 1, "", " bi"),
                    ("one", 2, "", " bi"),
                    ("other", 2, "", " bi"),
                    ("one", 3, "", " bi"),
                    ("other", 3, "", " bi"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mi"),
                    ("other", 1, "", " mi"),
                    ("one", 2, "", " mi"),
                    ("other", 2, "", " mi"),
                    ("one", 3, "", " mi"),
                    ("other", 3, "", " mi"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " mil"),
                    ("other", 1, "", " mil"),
                    ("one", 2, "", " mil"),
                    ("other", 2, "", " mil"),
                    ("one", 3, "", " mil"),
                    ("other", 3, "", " mil"),
                ],
            ),
        ],
    ),
    (
        "pt-BR",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " trilhão"),
                    ("other", 1, "", " trilhões"),
                    ("one", 2, "", " trilhão"),
                    ("other", 2, "", " trilhões"),
                    ("one", 3, "", " trilhão"),
                    ("other", 3, "", " trilhões"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " bilhão"),
                    ("other", 1, "", " bilhões"),
                    ("one", 2, "", " bilhão"),
                    ("other", 2, "", " bilhões"),
                    ("one", 3, "", " bilhão"),
                    ("other", 3, "", " bilhões"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " milhão"),
                    ("other", 1, "", " milhões"),
                    ("one", 2, "", " milhão"),
                    ("other", 2, "", " milhões"),
                    ("one", 3, "", " milhão"),
                    ("other", 3, "", " milhões"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " mil"),
                    ("other", 1, "", " mil"),
                    ("one", 2, "", " mil"),
                    ("other", 2, "", " mil"),
                    ("one", 3, "", " mil"),
                    ("other", 3, "", " mil"),
                ],
            ),
        ],
    ),
    (
        "ro-MD",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " tril."),
                    ("other", 1, "", " tril."),
                    ("one", 2, "", " tril."),
                    ("other", 2, "", " tril."),
                    ("one", 3, "", " tril."),
                    ("other", 3, "", " tril."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mld."),
                    ("other", 1, "", " mld."),
                    ("one", 2, "", " mld."),
                    ("other", 2, "", " mld."),
                    ("one", 3, "", " mld."),
                    ("other", 3, "", " mld."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mil."),
                    ("other", 1, "", " mil."),
                    ("one", 2, "", " mil."),
                    ("other", 2, "", " mil."),
                    ("one", 3, "", " mil."),
                    ("other", 3, "", " mil."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " K"),
                    ("other", 1, "", " K"),
                    ("one", 2, "", " K"),
                    ("other", 2, "", " K"),
                    ("one", 3, "", " K"),
                    ("other", 3, "", " K"),
                ],
            ),
        ],
    ),
    (
        "ro-MD",
        true,
        &[
            (
                12,
                &[
                    ("few", 1, "", " trilioane"),
                    ("one", 1, "", " trilion"),
                    ("other", 1, "", " de trilioane"),
                    ("few", 2, "", " trilioane"),
                    ("one", 2, "", " trilion"),
                    ("other", 2, "", " de trilioane"),
                    ("few", 3, "", " trilioane"),
                    ("one", 3, "", " trilion"),
                    ("other", 3, "", " de trilioane"),
                ],
            ),
            (
                9,
                &[
                    ("few", 1, "", " miliarde"),
                    ("one", 1, "", " miliard"),
                    ("other", 1, "", " de miliarde"),
                    ("few", 2, "", " miliarde"),
                    ("one", 2, "", " miliard"),
                    ("other", 2, "", " de miliarde"),
                    ("few", 3, "", " miliarde"),
                    ("one", 3, "", " miliard"),
                    ("other", 3, "", " de miliarde"),
                ],
            ),
            (
                6,
                &[
                    ("few", 1, "", " milioane"),
                    ("one", 1, "", " milion"),
                    ("other", 1, "", " de milioane"),
                    ("few", 2, "", " milioane"),
                    ("one", 2, "", " milion"),
                    ("other", 2, "", " de milioane"),
                    ("few", 3, "", " milioane"),
                    ("one", 3, "", " milion"),
                    ("other", 3, "", " de milioane"),
                ],
            ),
            (
                3,
                &[
                    ("few", 1, "", " mii"),
                    ("one", 1, "", " mie"),
                    ("other", 1, "", " de mii"),
                    ("few", 2, "", " mii"),
                    ("one", 2, "", " mie"),
                    ("other", 2, "", " de mii"),
                    ("few", 3, "", " mii"),
                    ("one", 3, "", " mie"),
                    ("other", 3, "", " de mii"),
                ],
            ),
        ],
    ),
    (
        "ru-RU",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " трлн"),
                    ("other", 1, "", " трлн"),
                    ("one", 2, "", " трлн"),
                    ("other", 2, "", " трлн"),
                    ("one", 3, "", " трлн"),
                    ("other", 3, "", " трлн"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " млрд"),
                    ("other", 1, "", " млрд"),
                    ("one", 2, "", " млрд"),
                    ("other", 2, "", " млрд"),
                    ("one", 3, "", " млрд"),
                    ("other", 3, "", " млрд"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " млн"),
                    ("other", 1, "", " млн"),
                    ("one", 2, "", " млн"),
                    ("other", 2, "", " млн"),
                    ("one", 3, "", " млн"),
                    ("other", 3, "", " млн"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " тыс."),
                    ("other", 1, "", " тыс."),
                    ("one", 2, "", " тыс."),
                    ("other", 2, "", " тыс."),
                    ("one", 3, "", " тыс."),
                    ("other", 3, "", " тыс."),
                ],
            ),
        ],
    ),
    (
        "ru-RU",
        true,
        &[
            (
                12,
                &[
                    ("few", 1, "", " триллиона"),
                    ("many", 1, "", " триллионов"),
                    ("one", 1, "", " триллион"),
                    ("other", 1, "", " триллиона"),
                    ("few", 2, "", " триллиона"),
                    ("many", 2, "", " триллионов"),
                    ("one", 2, "", " триллион"),
                    ("other", 2, "", " триллиона"),
                    ("few", 3, "", " триллиона"),
                    ("many", 3, "", " триллионов"),
                    ("one", 3, "", " триллион"),
                    ("other", 3, "", " триллиона"),
                ],
            ),
            (
                9,
                &[
                    ("few", 1, "", " миллиарда"),
                    ("many", 1, "", " миллиардов"),
                    ("one", 1, "", " миллиард"),
                    ("other", 1, "", " миллиарда"),
                    ("few", 2, "", " миллиарда"),
                    ("many", 2, "", " миллиардов"),
                    ("one", 2, "", " миллиард"),
                    ("other", 2, "", " миллиарда"),
                    ("few", 3, "", " миллиарда"),
                    ("many", 3, "", " миллиардов"),
                    ("one", 3, "", " миллиард"),
                    ("other", 3, "", " миллиарда"),
                ],
            ),
            (
                6,
                &[
                    ("few", 1, "", " миллиона"),
                    ("many", 1, "", " миллионов"),
                    ("one", 1, "", " миллион"),
                    ("other", 1, "", " миллиона"),
                    ("few", 2, "", " миллиона"),
                    ("many", 2, "", " миллионов"),
                    ("one", 2, "", " миллион"),
                    ("other", 2, "", " миллиона"),
                    ("few", 3, "", " миллиона"),
                    ("many", 3, "", " миллионов"),
                    ("one", 3, "", " миллион"),
                    ("other", 3, "", " миллиона"),
                ],
            ),
            (
                3,
                &[
                    ("few", 1, "", " тысячи"),
                    ("many", 1, "", " тысяч"),
                    ("one", 1, "", " тысяча"),
                    ("other", 1, "", " тысячи"),
                    ("few", 2, "", " тысячи"),
                    ("many", 2, "", " тысяч"),
                    ("one", 2, "", " тысяча"),
                    ("other", 2, "", " тысячи"),
                    ("few", 3, "", " тысячи"),
                    ("many", 3, "", " тысяч"),
                    ("one", 3, "", " тысяча"),
                    ("other", 3, "", " тысячи"),
                ],
            ),
        ],
    ),
    (
        "sr-Cyrl-RS",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " бил."),
                    ("other", 1, "", " бил."),
                    ("one", 2, "", " бил."),
                    ("other", 2, "", " бил."),
                    ("one", 3, "", " бил."),
                    ("other", 3, "", " бил."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " млрд."),
                    ("other", 1, "", " млрд."),
                    ("one", 2, "", " млрд."),
                    ("other", 2, "", " млрд."),
                    ("one", 3, "", " млрд."),
                    ("other", 3, "", " млрд."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " мил."),
                    ("other", 1, "", " мил."),
                    ("one", 2, "", " мил."),
                    ("other", 2, "", " мил."),
                    ("one", 3, "", " мил."),
                    ("other", 3, "", " мил."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " хиљ."),
                    ("other", 1, "", " хиљ."),
                    ("one", 2, "", " хиљ."),
                    ("other", 2, "", " хиљ."),
                    ("one", 3, "", " хиљ."),
                    ("other", 3, "", " хиљ."),
                ],
            ),
        ],
    ),
    (
        "sr-Cyrl-RS",
        true,
        &[
            (
                12,
                &[
                    ("few", 1, "", " билиона"),
                    ("one", 1, "", " билион"),
                    ("other", 1, "", " билиона"),
                    ("few", 2, "", " билиона"),
                    ("one", 2, "", " билион"),
                    ("other", 2, "", " билиона"),
                    ("few", 3, "", " билиона"),
                    ("one", 3, "", " билион"),
                    ("other", 3, "", " билиона"),
                ],
            ),
            (
                9,
                &[
                    ("few", 1, "", " милијарде"),
                    ("one", 1, "", " милијарда"),
                    ("other", 1, "", " милијарди"),
                    ("few", 2, "", " милијарде"),
                    ("one", 2, "", " милијарда"),
                    ("other", 2, "", " милијарди"),
                    ("few", 3, "", " милијарде"),
                    ("one", 3, "", " милијарда"),
                    ("other", 3, "", " милијарди"),
                ],
            ),
            (
                6,
                &[
                    ("few", 1, "", " милиона"),
                    ("one", 1, "", " милион"),
                    ("other", 1, "", " милиона"),
                    ("few", 2, "", " милиона"),
                    ("one", 2, "", " милион"),
                    ("other", 2, "", " милиона"),
                    ("few", 3, "", " милиона"),
                    ("one", 3, "", " милион"),
                    ("other", 3, "", " милиона"),
                ],
            ),
            (
                3,
                &[
                    ("few", 1, "", " хиљаде"),
                    ("one", 1, "", " хиљада"),
                    ("other", 1, "", " хиљада"),
                    ("few", 2, "", " хиљаде"),
                    ("one", 2, "", " хиљада"),
                    ("other", 2, "", " хиљада"),
                    ("few", 3, "", " хиљаде"),
                    ("one", 3, "", " хиљада"),
                    ("other", 3, "", " хиљада"),
                ],
            ),
        ],
    ),
    (
        "sr-Latn-RS",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bil."),
                    ("other", 1, "", " bil."),
                    ("one", 2, "", " bil."),
                    ("other", 2, "", " bil."),
                    ("one", 3, "", " bil."),
                    ("other", 3, "", " bil."),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mlrd."),
                    ("other", 1, "", " mlrd."),
                    ("one", 2, "", " mlrd."),
                    ("other", 2, "", " mlrd."),
                    ("one", 3, "", " mlrd."),
                    ("other", 3, "", " mlrd."),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mil."),
                    ("other", 1, "", " mil."),
                    ("one", 2, "", " mil."),
                    ("other", 2, "", " mil."),
                    ("one", 3, "", " mil."),
                    ("other", 3, "", " mil."),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " hilj."),
                    ("other", 1, "", " hilj."),
                    ("one", 2, "", " hilj."),
                    ("other", 2, "", " hilj."),
                    ("one", 3, "", " hilj."),
                    ("other", 3, "", " hilj."),
                ],
            ),
        ],
    ),
    (
        "sr-Latn-RS",
        true,
        &[
            (
                12,
                &[
                    ("few", 1, "", " biliona"),
                    ("one", 1, "", " bilion"),
                    ("other", 1, "", " biliona"),
                    ("few", 2, "", " biliona"),
                    ("one", 2, "", " bilion"),
                    ("other", 2, "", " biliona"),
                    ("few", 3, "", " biliona"),
                    ("one", 3, "", " bilion"),
                    ("other", 3, "", " biliona"),
                ],
            ),
            (
                9,
                &[
                    ("few", 1, "", " milijarde"),
                    ("one", 1, "", " milijarda"),
                    ("other", 1, "", " milijardi"),
                    ("few", 2, "", " milijarde"),
                    ("one", 2, "", " milijarda"),
                    ("other", 2, "", " milijardi"),
                    ("few", 3, "", " milijarde"),
                    ("one", 3, "", " milijarda"),
                    ("other", 3, "", " milijardi"),
                ],
            ),
            (
                6,
                &[
                    ("few", 1, "", " miliona"),
                    ("one", 1, "", " milion"),
                    ("other", 1, "", " miliona"),
                    ("few", 2, "", " miliona"),
                    ("one", 2, "", " milion"),
                    ("other", 2, "", " miliona"),
                    ("few", 3, "", " miliona"),
                    ("one", 3, "", " milion"),
                    ("other", 3, "", " miliona"),
                ],
            ),
            (
                3,
                &[
                    ("few", 1, "", " hiljade"),
                    ("one", 1, "", " hiljada"),
                    ("other", 1, "", " hiljada"),
                    ("few", 2, "", " hiljade"),
                    ("one", 2, "", " hiljada"),
                    ("other", 2, "", " hiljada"),
                    ("few", 3, "", " hiljade"),
                    ("one", 3, "", " hiljada"),
                    ("other", 3, "", " hiljada"),
                ],
            ),
        ],
    ),
    (
        "sv-SE",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " bn"),
                    ("other", 1, "", " bn"),
                    ("one", 2, "", " bn"),
                    ("other", 2, "", " bn"),
                    ("one", 3, "", " bn"),
                    ("other", 3, "", " bn"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " md"),
                    ("other", 1, "", " md"),
                    ("one", 2, "", " md"),
                    ("other", 2, "", " md"),
                    ("one", 3, "", " md"),
                    ("other", 3, "", " md"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mn"),
                    ("other", 1, "", " mn"),
                    ("one", 2, "", " mn"),
                    ("other", 2, "", " mn"),
                    ("one", 3, "", " mn"),
                    ("other", 3, "", " mn"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " tn"),
                    ("other", 1, "", " tn"),
                    ("one", 2, "", " tn"),
                    ("other", 2, "", " tn"),
                    ("one", 3, "", " tn"),
                    ("other", 3, "", " tn"),
                ],
            ),
        ],
    ),
    (
        "sv-SE",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " biljon"),
                    ("other", 1, "", " biljoner"),
                    ("one", 2, "", " biljoner"),
                    ("other", 2, "", " biljoner"),
                    ("one", 3, "", " biljoner"),
                    ("other", 3, "", " biljoner"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " miljard"),
                    ("other", 1, "", " miljarder"),
                    ("one", 2, "", " miljarder"),
                    ("other", 2, "", " miljarder"),
                    ("one", 3, "", " miljarder"),
                    ("other", 3, "", " miljarder"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " miljon"),
                    ("other", 1, "", " miljoner"),
                    ("one", 2, "", " miljon"),
                    ("other", 2, "", " miljoner"),
                    ("one", 3, "", " miljoner"),
                    ("other", 3, "", " miljoner"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " tusen"),
                    ("other", 1, "", " tusen"),
                    ("one", 2, "", " tusen"),
                    ("other", 2, "", " tusen"),
                    ("one", 3, "", " tusen"),
                    ("other", 3, "", " tusen"),
                ],
            ),
        ],
    ),
    (
        "th-TH",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", "T"),
                    ("other", 1, "", "T"),
                    ("one", 2, "", "T"),
                    ("other", 2, "", "T"),
                    ("one", 3, "", "T"),
                    ("other", 3, "", "T"),
                ],
            ),
            (
                9,
                &[
                    ("other", 1, "", "B"),
                    ("other", 2, "", "B"),
                    ("other", 3, "", "B"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", "M"),
                    ("other", 1, "", "M"),
                    ("one", 2, "", "M"),
                    ("other", 2, "", "M"),
                    ("one", 3, "", "M"),
                    ("other", 3, "", "M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "K"),
                    ("other", 1, "", "K"),
                    ("one", 2, "", "K"),
                    ("other", 2, "", "K"),
                    ("one", 3, "", "K"),
                    ("other", 3, "", "K"),
                ],
            ),
        ],
    ),
    (
        "th-TH",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", "T"),
                    ("other", 1, "", " ล้านล้าน"),
                    ("one", 2, "", "T"),
                    ("other", 2, "", " ล้านล้าน"),
                    ("one", 3, "", "T"),
                    ("other", 3, "", " ล้านล้าน"),
                ],
            ),
            (11, &[("other", 1, "", " แสนล้าน")]),
            (10, &[("other", 1, "", " หมื่นล้าน")]),
            (
                9,
                &[
                    ("other", 1, "", " พันล้าน"),
                    ("other", 2, "", "B"),
                    ("other", 3, "", "B"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", "M"),
                    ("other", 1, "", " ล้าน"),
                    ("one", 2, "", "M"),
                    ("other", 2, "", " ล้าน"),
                    ("one", 3, "", "M"),
                    ("other", 3, "", " ล้าน"),
                ],
            ),
            (5, &[("other", 1, "", " แสน")]),
            (4, &[("other", 1, "", " หมื่น")]),
            (
                3,
                &[
                    ("one", 1, "", "K"),
                    ("other", 1, "", " พัน"),
                    ("one", 2, "", "K"),
                    ("other", 2, "", "K"),
                    ("one", 3, "", "K"),
                    ("other", 3, "", "K"),
                ],
            ),
        ],
    ),
    (
        "tr-TR",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " Tn"),
                    ("other", 1, "", " Tn"),
                    ("one", 2, "", " Tn"),
                    ("other", 2, "", " Tn"),
                    ("one", 3, "", " Tn"),
                    ("other", 3, "", " Tn"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " Mr"),
                    ("other", 1, "", " Mr"),
                    ("one", 2, "", " Mr"),
                    ("other", 2, "", " Mr"),
                    ("one", 3, "", " Mr"),
                    ("other", 3, "", " Mr"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " Mn"),
                    ("other", 1, "", " Mn"),
                    ("one", 2, "", " Mn"),
                    ("other", 2, "", " Mn"),
                    ("one", 3, "", " Mn"),
                    ("other", 3, "", " Mn"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " B"),
                    ("other", 1, "", " B"),
                    ("one", 2, "", " B"),
                    ("other", 2, "", " B"),
                    ("one", 3, "", " B"),
                    ("other", 3, "", " B"),
                ],
            ),
        ],
    ),
    (
        "tr-TR",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " trilyon"),
                    ("other", 1, "", " trilyon"),
                    ("one", 2, "", " trilyon"),
                    ("other", 2, "", " trilyon"),
                    ("one", 3, "", " trilyon"),
                    ("other", 3, "", " trilyon"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " milyar"),
                    ("other", 1, "", " milyar"),
                    ("one", 2, "", " milyar"),
                    ("other", 2, "", " milyar"),
                    ("one", 3, "", " milyar"),
                    ("other", 3, "", " milyar"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " milyon"),
                    ("other", 1, "", " milyon"),
                    ("one", 2, "", " milyon"),
                    ("other", 2, "", " milyon"),
                    ("one", 3, "", " milyon"),
                    ("other", 3, "", " milyon"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " bin"),
                    ("other", 1, "", " bin"),
                    ("one", 2, "", " bin"),
                    ("other", 2, "", " bin"),
                    ("one", 3, "", " bin"),
                    ("other", 3, "", " bin"),
                ],
            ),
        ],
    ),
    (
        "uk-UA",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " трлн"),
                    ("other", 1, "", " трлн"),
                    ("one", 2, "", " трлн"),
                    ("other", 2, "", " трлн"),
                    ("one", 3, "", " трлн"),
                    ("other", 3, "", " трлн"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " млрд"),
                    ("other", 1, "", " млрд"),
                    ("one", 2, "", " млрд"),
                    ("other", 2, "", " млрд"),
                    ("one", 3, "", " млрд"),
                    ("other", 3, "", " млрд"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " млн"),
                    ("other", 1, "", " млн"),
                    ("one", 2, "", " млн"),
                    ("other", 2, "", " млн"),
                    ("one", 3, "", " млн"),
                    ("other", 3, "", " млн"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " тис."),
                    ("other", 1, "", " тис."),
                    ("one", 2, "", " тис."),
                    ("other", 2, "", " тис."),
                    ("one", 3, "", " тис."),
                    ("other", 3, "", " тис."),
                ],
            ),
        ],
    ),
    (
        "uk-UA",
        true,
        &[
            (
                12,
                &[
                    ("few", 1, "", " трильйони"),
                    ("many", 1, "", " трильйонів"),
                    ("one", 1, "", " трильйон"),
                    ("other", 1, "", " трильйона"),
                    ("few", 2, "", " трильйони"),
                    ("many", 2, "", " трильйонів"),
                    ("one", 2, "", " трильйон"),
                    ("other", 2, "", " трильйона"),
                    ("few", 3, "", " трильйони"),
                    ("many", 3, "", " трильйонів"),
                    ("one", 3, "", " трильйон"),
                    ("other", 3, "", " трильйона"),
                ],
            ),
            (
                9,
                &[
                    ("few", 1, "", " мільярди"),
                    ("many", 1, "", " мільярдів"),
                    ("one", 1, "", " мільярд"),
                    ("other", 1, "", " мільярда"),
                    ("few", 2, "", " мільярди"),
                    ("many", 2, "", " мільярдів"),
                    ("one", 2, "", " мільярд"),
                    ("other", 2, "", " мільярда"),
                    ("few", 3, "", " мільярди"),
                    ("many", 3, "", " мільярдів"),
                    ("one", 3, "", " мільярд"),
                    ("other", 3, "", " мільярда"),
                ],
            ),
            (
                6,
                &[
                    ("few", 1, "", " мільйони"),
                    ("many", 1, "", " мільйонів"),
                    ("one", 1, "", " мільйон"),
                    ("other", 1, "", " мільйона"),
                    ("few", 2, "", " мільйони"),
                    ("many", 2, "", " мільйонів"),
                    ("one", 2, "", " мільйон"),
                    ("other", 2, "", " мільйона"),
                    ("few", 3, "", " мільйони"),
                    ("many", 3, "", " мільйонів"),
                    ("one", 3, "", " мільйон"),
                    ("other", 3, "", " мільйона"),
                ],
            ),
            (
                3,
                &[
                    ("few", 1, "", " тисячі"),
                    ("many", 1, "", " тисяч"),
                    ("one", 1, "", " тисяча"),
                    ("other", 1, "", " тисячі"),
                    ("few", 2, "", " тисячі"),
                    ("many", 2, "", " тисяч"),
                    ("one", 2, "", " тисяча"),
                    ("other", 2, "", " тисячі"),
                    ("few", 3, "", " тисячі"),
                    ("many", 3, "", " тисяч"),
                    ("one", 3, "", " тисяча"),
                    ("other", 3, "", " тисячі"),
                ],
            ),
        ],
    ),
    (
        "uz-Latn-UZ",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", " trln"),
                    ("other", 1, "", " trln"),
                    ("one", 2, "", " trln"),
                    ("other", 2, "", " trln"),
                    ("one", 3, "", " trln"),
                    ("other", 3, "", " trln"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " mlrd"),
                    ("other", 1, "", " mlrd"),
                    ("one", 2, "", " mlrd"),
                    ("other", 2, "", " mlrd"),
                    ("one", 3, "", " mlrd"),
                    ("other", 3, "", " mlrd"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " mln"),
                    ("other", 1, "", " mln"),
                    ("one", 2, "", " mln"),
                    ("other", 2, "", " mln"),
                    ("one", 3, "", " mln"),
                    ("other", 3, "", " mln"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " ming"),
                    ("other", 1, "", " ming"),
                    ("one", 2, "", " ming"),
                    ("other", 2, "", " ming"),
                    ("one", 3, "", " ming"),
                    ("other", 3, "", " ming"),
                ],
            ),
        ],
    ),
    (
        "uz-Latn-UZ",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", " trillion"),
                    ("other", 1, "", " trillion"),
                    ("one", 2, "", " trillion"),
                    ("other", 2, "", " trillion"),
                    ("one", 3, "", " trillion"),
                    ("other", 3, "", " trillion"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", " milliard"),
                    ("other", 1, "", " milliard"),
                    ("one", 2, "", " milliard"),
                    ("other", 2, "", " milliard"),
                    ("one", 3, "", " milliard"),
                    ("other", 3, "", " milliard"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", " million"),
                    ("other", 1, "", " million"),
                    ("one", 2, "", " million"),
                    ("other", 2, "", " million"),
                    ("one", 3, "", " million"),
                    ("other", 3, "", " million"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", " ming"),
                    ("other", 1, "", " ming"),
                    ("one", 2, "", " ming"),
                    ("other", 2, "", " ming"),
                    ("one", 3, "", " ming"),
                    ("other", 3, "", " ming"),
                ],
            ),
        ],
    ),
    (
        "vi-VN",
        false,
        &[
            (
                12,
                &[
                    ("other", 1, "", " NT"),
                    ("other", 2, "", " NT"),
                    ("other", 3, "", " NT"),
                ],
            ),
            (
                9,
                &[
                    ("other", 1, "", " T"),
                    ("other", 2, "", " T"),
                    ("other", 3, "", " T"),
                ],
            ),
            (
                6,
                &[
                    ("other", 1, "", " Tr"),
                    ("other", 2, "", " Tr"),
                    ("other", 3, "", " Tr"),
                ],
            ),
            (
                3,
                &[
                    ("other", 1, "", " N"),
                    ("other", 2, "", " N"),
                    ("other", 3, "", " N"),
                ],
            ),
        ],
    ),
    (
        "vi-VN",
        true,
        &[
            (
                12,
                &[
                    ("other", 1, "", " nghìn tỷ"),
                    ("other", 2, "", " nghìn tỷ"),
                    ("other", 3, "", " nghìn tỷ"),
                ],
            ),
            (
                9,
                &[
                    ("other", 1, "", " tỷ"),
                    ("other", 2, "", " tỷ"),
                    ("other", 3, "", " tỷ"),
                ],
            ),
            (
                6,
                &[
                    ("other", 1, "", " triệu"),
                    ("other", 2, "", " triệu"),
                    ("other", 3, "", " triệu"),
                ],
            ),
            (
                3,
                &[
                    ("other", 1, "", " nghìn"),
                    ("other", 2, "", " nghìn"),
                    ("other", 3, "", " nghìn"),
                ],
            ),
        ],
    ),
    (
        "yi",
        false,
        &[
            (
                12,
                &[
                    ("one", 1, "", "T"),
                    ("other", 1, "", "T"),
                    ("one", 2, "", "T"),
                    ("other", 2, "", "T"),
                    ("one", 3, "", "T"),
                    ("other", 3, "", "T"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", "B"),
                    ("other", 1, "", "B"),
                    ("one", 2, "", "B"),
                    ("other", 2, "", "B"),
                    ("one", 3, "", "B"),
                    ("other", 3, "", "B"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", "M"),
                    ("other", 1, "", "M"),
                    ("one", 2, "", "M"),
                    ("other", 2, "", "M"),
                    ("one", 3, "", "M"),
                    ("other", 3, "", "M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "K"),
                    ("other", 1, "", "K"),
                    ("one", 2, "", "K"),
                    ("other", 2, "", "K"),
                    ("one", 3, "", "K"),
                    ("other", 3, "", "K"),
                ],
            ),
        ],
    ),
    (
        "yi",
        true,
        &[
            (
                12,
                &[
                    ("one", 1, "", "T"),
                    ("other", 1, "", "T"),
                    ("one", 2, "", "T"),
                    ("other", 2, "", "T"),
                    ("one", 3, "", "T"),
                    ("other", 3, "", "T"),
                ],
            ),
            (
                9,
                &[
                    ("one", 1, "", "B"),
                    ("other", 1, "", "B"),
                    ("one", 2, "", "B"),
                    ("other", 2, "", "B"),
                    ("one", 3, "", "B"),
                    ("other", 3, "", "B"),
                ],
            ),
            (
                6,
                &[
                    ("one", 1, "", "M"),
                    ("other", 1, "", "M"),
                    ("one", 2, "", "M"),
                    ("other", 2, "", "M"),
                    ("one", 3, "", "M"),
                    ("other", 3, "", "M"),
                ],
            ),
            (
                3,
                &[
                    ("one", 1, "", "K"),
                    ("other", 1, "", "K"),
                    ("one", 2, "", "K"),
                    ("other", 2, "", "K"),
                    ("one", 3, "", "K"),
                    ("other", 3, "", "K"),
                ],
            ),
        ],
    ),
    (
        "zh-CN",
        false,
        &[
            (
                12,
                &[
                    ("other", 1, "", "万亿"),
                    ("other", 2, "", "万亿"),
                    ("other", 3, "", "万亿"),
                ],
            ),
            (
                8,
                &[
                    ("other", 1, "", "亿"),
                    ("other", 2, "", "亿"),
                    ("other", 3, "", "亿"),
                    ("other", 4, "", "亿"),
                ],
            ),
            (
                4,
                &[
                    ("other", 1, "", "万"),
                    ("other", 2, "", "万"),
                    ("other", 3, "", "万"),
                    ("other", 4, "", "万"),
                ],
            ),
        ],
    ),
    (
        "zh-CN",
        true,
        &[
            (
                12,
                &[
                    ("other", 1, "", "万亿"),
                    ("other", 2, "", "万亿"),
                    ("other", 3, "", "万亿"),
                ],
            ),
            (
                8,
                &[
                    ("other", 1, "", "亿"),
                    ("other", 2, "", "亿"),
                    ("other", 3, "", "亿"),
                    ("other", 4, "", "亿"),
                ],
            ),
            (
                4,
                &[
                    ("other", 1, "", "万"),
                    ("other", 2, "", "万"),
                    ("other", 3, "", "万"),
                    ("other", 4, "", "万"),
                ],
            ),
        ],
    ),
    (
        "zh-Hant-TW",
        false,
        &[
            (
                12,
                &[
                    ("other", 1, "", "兆"),
                    ("other", 2, "", "兆"),
                    ("other", 3, "", "兆"),
                ],
            ),
            (
                8,
                &[
                    ("other", 1, "", "億"),
                    ("other", 2, "", "億"),
                    ("other", 3, "", "億"),
                    ("other", 4, "", "億"),
                ],
            ),
            (
                4,
                &[
                    ("other", 1, "", "萬"),
                    ("other", 2, "", "萬"),
                    ("other", 3, "", "萬"),
                    ("other", 4, "", "萬"),
                ],
            ),
        ],
    ),
    (
        "zh-Hant-TW",
        true,
        &[
            (
                12,
                &[
                    ("other", 1, "", "兆"),
                    ("other", 2, "", "兆"),
                    ("other", 3, "", "兆"),
                ],
            ),
            (
                8,
                &[
                    ("other", 1, "", "億"),
                    ("other", 2, "", "億"),
                    ("other", 3, "", "億"),
                    ("other", 4, "", "億"),
                ],
            ),
            (
                4,
                &[
                    ("other", 1, "", "萬"),
                    ("other", 2, "", "萬"),
                    ("other", 3, "", "萬"),
                    ("other", 4, "", "萬"),
                ],
            ),
        ],
    ),
];

fn locale_matches(row: &str, locale: &str) -> bool {
    locale == row || locale.starts_with(row) && locale.as_bytes().get(row.len()) == Some(&b'-')
}

pub(crate) fn number_compact_entries(
    locale: &str,
    long: bool,
) -> Option<&'static [(i32, &'static str)]> {
    NUMBER_COMPACT_ROWS
        .iter()
        .filter(|(row, is_long, _)| *is_long == long && locale_matches(row, locale))
        .max_by_key(|(row, _, _)| row.len())
        .map(|(_, _, entries)| *entries)
}

pub(crate) fn number_compact_pattern(
    locale: &str,
    long: bool,
    power: i32,
    category: &str,
    integer_digits: usize,
) -> Option<(&'static str, &'static str)> {
    NUMBER_COMPACT_VARIANT_ROWS
        .iter()
        .filter(|(row, is_long, _)| *is_long == long && locale_matches(row, locale))
        .max_by_key(|(row, _, _)| row.len())
        .and_then(|(_, _, entries)| entries.iter().find(|(p, _)| *p == power))
        .and_then(|(_, variants)| {
            variants
                .iter()
                .find(|(cat, zeros, _, _)| *cat == category && *zeros as usize == integer_digits)
                .or_else(|| {
                    variants.iter().find(|(cat, zeros, _, _)| {
                        *cat == "other" && *zeros as usize == integer_digits
                    })
                })
                .or_else(|| variants.iter().find(|(cat, _, _, _)| *cat == category))
                .or_else(|| variants.iter().find(|(cat, _, _, _)| *cat == "other"))
                .map(|(_, _, prefix, suffix)| (*prefix, *suffix))
        })
}

pub(crate) fn number_compact_suffix(
    locale: &str,
    long: bool,
    power: i32,
    category: &str,
) -> Option<&'static str> {
    number_compact_pattern(locale, long, power, category, 0).map(|(_, suffix)| suffix)
}
